import GlobalData from "./Global";

const {ccclass, property} = cc._decorator;

@ccclass
export default class InputViewController extends cc.Component {

    //#region Property

    @property(cc.EditBox)
    inputBox: cc.EditBox = null;

    @property(cc.Label)
    notice: cc.Label = null;

    // @property(cc.Node)
    // listButton: cc.Node = null;
    // @property(cc.Node)
    // cancelCompareButton: cc.Node = null;

    NOTICE_DURATION = 1.0;

    GlobalData:GlobalData = null;

    //#endregion

    //#region Lifecycle

    onLoad () {
        let globalNode = cc.director.getScene().getChildByName('GlobalNode');
        this.GlobalData = globalNode.getComponent(GlobalData);
        // if (this.GlobalData.Compare) {
        //     this.listButton.active = false;
        //     this.cancelCompareButton.active = true;
        // }
        // else{
        //     this.listButton.active = true;
        //     this.cancelCompareButton.active = false;
        // }
    }

    start () {
        this.inputBox.setFocus();
    }

    // update (dt) {}

    //#endregion

    //#region input 

    FinishInput(){
        // console.log("xxx " + this.inputBox.string);

        let param = this.inputBox.string.trim();
        let paramArr = param.split(" ");

        let hanzi = "";
        let pinyin = "";

        let valid = false;
        if (paramArr.length == 2) {
            valid = true;

            // if hanzi, try convert pinyin
            if (!this.IsPinyin(param[0])) {
                for (let i = 0; i < paramArr[0].length; i++) {
                    let pyChar = this.GetPinyin(paramArr[0][i]);
                    if (pyChar != "") {
                        pinyin += pyChar;
                        hanzi += paramArr[0][i];
                    }
                    else{
                        this.notice.string = "无法识别汉字，请用拼音重新输入";
                        valid = false;
                        break;
                    }
                }
            }
            else{ // if pinyin, check all pinyin
                for (let i = 0; i < paramArr[0].length; i++) {
                    if (this.IsPinyin(paramArr[0][i])) {
                        pinyin += paramArr[0][i];
                        hanzi += paramArr[0][i];
                    }
                    else{
                        this.notice.string = "拼音输入有误，请重新输入";
                        valid = false;
                        break;
                    }
                }
            }

            //check birthday
            if (paramArr[1].length == 8) {
                for (let i = 0; i < paramArr[1].length; i++) {
                    if (!this.IsDigit(paramArr[1][i])) {
                        this.notice.string = "生日输入有误，请重新输入";
                        valid = false;
                        break;
                    }
                }
            }
            else{
                valid = false;
                this.notice.string = "生日输入有误，请重新输入";
            }
        }
        else{
            valid = false;
            this.notice.string = "请按“姓名(空格)19910215”的格式输入";
        }

        if (valid) {
            param = hanzi + " " + pinyin + " " + paramArr[1];

            // console.log("xxx valid : " + param);

            if (!this.GlobalData.Compare) {
                this.GlobalData.ParamList.splice(0,this.GlobalData.ParamList.length);                
            }
            this.GlobalData.ParamList.push(param);
            cc.director.loadScene("MainView");
        }
        else {
            this.inputBox.string = "";
            this.notice.node.opacity = 255;
            this.notice.node.runAction(cc.sequence(
                cc.scaleTo(this.NOTICE_DURATION * 0.3, 1.1, 1.1),
                cc.scaleTo(this.NOTICE_DURATION * 0.7, 1.0, 1.0)
            ));
            
            // this.node.runAction(cc.sequence(
            //     cc.delayTime(0.7),
            //     cc.callFunc(()=>this.SetFocus())
            // ));
        }
    }

    SetFocus(){
        this.inputBox.stayOnTop = true;
        this.inputBox.setFocus();
    }

    DIGITS = ["0","1","2","3","4","5","6","7","8","9"];
    IsDigit(str:string) : boolean {
        let isDigit = false;
        for (let i = 0; i < this.DIGITS.length; i++) {
            if (str == this.DIGITS[i]) {
                isDigit = true;
                break;
            }
        }

        return isDigit;
    }

    PINYIN_LIST = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"];
    IsPinyin(str:string) : boolean {
        let isPinyin = false;
        for (let i = 0; i < this.PINYIN_LIST.length; i++) {
            if (str == this.PINYIN_LIST[i]) {
                isPinyin = true;
                break;
            }
        }

        return isPinyin;
    }

    Editing(){
        if (this.inputBox.string.length > 0) {
            this.notice.node.opacity = 0;            
        }
    }

    //#endregion

    //#region Navigation

    GoBack(){
        cc.director.loadScene("MainView");
    }

    CancelCompare(){
        cc.director.loadScene("MainView");
    }

    //#endregion

    //#region Pinyin

    @property(cc.Label)
    PYLabel: cc.Label = null;

    GetPinyin(hanzi:string) : string {
        let pinyin = "";

        let idx = 0;
        let found = false;
        while (idx < this.PinyinDictionary.length) {
            let str = this.PinyinDictionary[idx];
            if (str == hanzi) {
                found = true;
            }
            if (found) {
                if (str[0] == ":") {
                    pinyin = str.replace(":","");
                    break;
                }
            }
            idx++;
        }
        
        return pinyin;
    }

    FixPinYin(target:string) : string {
        let fix = target;
        if (target == "ā" || target == "á" || target == "ǎ" || target == "à") {
            fix = "a";
        }
        else if (target == "ē" || target == "é" || target == "ě" || target == "è") {
            fix = "e";
        }
        else if (target == "ō" || target == "ó" || target == "ǒ" || target == "ò") {
            fix = "o";
        }
        else if (target == "ī" || target == "í" || target == "ǐ" || target == "ì") {
            fix = "i";
        }
        else if (target == "ū" || target == "ú" || target == "ǔ" || target == "ù") {
            fix = "u";
        }
        else if (target == "ü" || target == "ǘ" || target == "ǚ" || target == "ǜ") {
            fix = "u";
        }
        else if (target == "ń" || target == "ň") {
            fix = "n";
        }
        else if (target == "") {
            fix = "m";
        }
        return fix;
    }

    //#endregion

    test(){
        this.inputBox.string += "\n";
    }

    //#region Pinyin

    PinyinDictionary = 
    ["啊","阿","吖","嗄","錒","锕",":a"
    ,"乂","伌","僾","凒","剴","叆","啀","嘊","噯","堨","塧","壒","娾","嬡","嵦","愛","懓","懝","敱","敳",
    "昹","曖","欬","毐","溰","溾","濭","焥","璦","皚","皧","埃","挨","哎","唉","哀","皑","癌","蔼","矮",
    "艾","碍","爱","隘","瞹","硋","礙","薆","藹","譪","譺","賹","躷","捱","嗳","嗌","銰","鎄","嫒","鑀",
    "瑷","閡","暧","隑","靄","靉","砹","锿","餲","馤","騃","鯦","霭","鱫","鴱",":ai"
    ,"侒","儑","厰","唵","啽","垵","垾","堓","婩","媕","屽","峖","晻","洝","玵","痷","鞍","氨","安","俺",
    "按","暗","岸","胺","案","盦","盫","碪","罯","腤","荌","萻","葊","蓭","誝","諳","豻","貋","谙","埯",
    "揞","遃","犴","庵","銨","錌","桉","闇","隌","雸","鞌","韽","頇","铵","鹌","馣","鮟","黯","鴳","鵪",
    "鶕",":an"
    ,"卬","岇","昻","枊","肮","昂","盎","醠","骯",":ang"
    ,"厫","嗸","嚻","垇","墺","奡","奧","媼","嫯","岰","嶅","嶴","慠","扷","抝","摮","擙","柪","梎","泑",
    "滶","澚","熝","爊","獓","璈","凹","敖","熬","翱","袄","傲","奥","懊","澳","眑","磝","翶","翺","芺",
    "蔜","蝹","襖","謷","謸","坳","軪","郩","嗷","岙","廒","遨","媪","骜","鏕","镺","獒","隞","聱","驁",
    "螯","鰲","鏊","鳌","鏖","鴁","鷔","鼇",":ao"
    ,"丷","仈","叐","哵","坺","墢","壩","夿","妭","峇","弝","抜","朳","柭","欛","炦","犮","玐","癹","皅",
    "芭","捌","扒","叭","吧","笆","八","疤","巴","拔","跋","靶","把","坝","霸","罢","爸","矲","紦","罷",
    "羓","胈","蚆","覇","詙","豝","茇","軷","菝","釛","釟","岜","鈀","灞","钯","颰","魞","粑","鮁","鮊",
    "鲅","鲃","鲌","魃","鼥",":ba"
    ,"庍","拝","挀","擺","敗","栢","白","柏","百","摆","佰","败","拜","稗","竡","粨","粺","絔","薭","襬",
    "贁","捭","掰","鞁","韛",":bai"
    ,"姅","岅","怑","搫","攽","斒","昄","朌","湴","瓪","斑","班","搬","扳","般","颁","板","版","扮","拌",
    "伴","瓣","半","办","绊","秚","籓","粄","絆","肦","蝂","螁","螌","褩","覂","阪","跘","坂","辦","辬",
    "鈑","鉡","靽","頒","钣","瘢","癍","魬","舨","鳻",":ban"
    ,"垹","埲","塝","嫎","峀","幇","幚","幫","徬","捠","棓","牓","玤","邦","帮","梆","榜","膀","绑","棒",
    "蚌","镑","傍","谤","硥","稖","綁","縍","艕","蚄","蛖","蜯","謗","蒡","邫","浜","鎊","鞤","騯",":bang"
    ,"佨","儤","剝","勽","堢","報","媬","嫑","寚","寳","寶","忁","怉","曓","枹","珤","苞","胞","包","褒",
    "剥","薄","雹","保","堡","饱","宝","抱","报","暴","豹","鲍","爆","窇","笣","緥","瀑","菢","蕔","藵",
    "虣","蚫","袌","裦","襃","賲","勹","葆","鉋","宀","孢","鑤","铇","闁","靌","靤","煲","飹","飽","鸨",
    "駂","褓","骲","髱","鮑","龅","鳵","鴇","齙",":bao"
    ,"萡",":be"
    ,"俻","偝","偹","備","僃","哱","唄","喺","垻","愂","憊","揹","昁","杮","柸","桮","梖","棑","椑","牬",
    "犕","狽","珼","琲","盃","杯","碑","悲","卑","北","辈","背","贝","钡","倍","狈","备","惫","焙","被",
    "禙","糒","苝","藣","蛽","誖","諀","貝","陂","邶","軰","輩","蓓","呗","鄁","鉳","悖","鋇","錍","鐴",
    "韝","碚","鹎","褙","骳","鐾","鞴","鵯",":bei"
    ,"倴","喯","夲","奙","捹","撪","桳","楍","泍","渀","炃","燌","犇","獖","奔","苯","本","笨","夯","翉",
    "賁","畚","坌","輽","逩","錛","贲","锛",":ben"
    ,"伻","傰","嗙","埄","塴","奟","嵭","挷","揼","搒","琣","琫","痭","崩","绷","甭","泵","蹦","迸","祊",
    "絣","綳","繃","菶","跰","逬","嘣","錋","鏰","镚","閍","甏","鞛",":beng"
    ,"佊","佖","偪","匂","咇","啚","嗶","坒","堛","夶","奰","妼","娝","嬶","屄","崥","幣","幤","廦","弻",
    "彃","怭","怶","悂","愊","斃","旇","朼","枈","柀","柲","梐","楅","毴","沘","湢","滭","潷","煏","熚",
    "獘","獙","珌","畁","畐","畢","疕","疪","痺","皀","皕","逼","鼻","比","鄙","笔","彼","碧","蓖","蔽",
    "毕","毙","毖","币","庇","痹","闭","敝","弊","必","壁","臂","避","陛","祕","禆","稫","笓","筆","箃",
    "箄","箆","篳","粃","粊","綼","縪","繴","罼","翍","聛","肶","肸","胇","腷","苾","萞","蓽","蜌","螕",
    "袐","襅","襣","觱","詖","诐","豍","貏","匕","貱","俾","贔","赑","踾","蹕","躃","躄","荜","荸","萆",
    "薜","邲","吡","哔","鄨","鄪","狴","鈚","庳","鉍","愎","滗","濞","弼","妣","鎞","婢","嬖","鏎","璧",
    "閇","閈","閉","閟","闬","鞞","鞸","韠","畀","铋","飶","秕","饆","馝","駜","裨","驆","髲","筚","箅",
    "篦","魓","魮","舭","襞","鮅","鮩","跸","鰏","鲾","髀","鴓","鵖","鶝","鷝","鷩","鸊","鼊",":bi"
    ,"変","峅","惼","抃","揙","昪","汳","炞","牑","猵","獱","甂","疺","鞭","边","编","贬","扁","便","变",
    "卞","辨","辩","辫","遍","稨","箯","籩","糄","編","緶","臱","艑","萹","藊","覍","覵","變","匾","貶",
    "弁","苄","辡","辧","辮","辯","邉","邊","釆","忭","汴","鍽","缏","閞","煸","砭","碥","窆","褊","蝙",
    "笾","鯾","鯿","鳊","鴘","鶣",":bian"
    ,"俵","僄","儦","墂","幖","徱","摽","標","檦","淲","滮","瀌","熛","爂","猋","标","彪","膘","表","穮",
    "篻","脿","膔","臕","蔈","藨","褾","諘","謤","贆","錶","婊","骠","鏢","鑣","飑","飙","飚","颷","飆",
    "飇","飈","飊","镖","镳","瘭","裱","驃","驫","骉","鰾","鳔","髟","麃",":biao"
    ,"別","彆","徶","癟","鳖","憋","别","瘪","穪","莂","虌","蛂","蟞","襒","蹩","鱉","鼈","龞",":bie"
    ,"儐","擯","椕","檳","殯","氞","汃","濱","濵","瀕","瑸","璸","彬","斌","濒","滨","宾","摈","砏","繽",
    "臏","虨","蠙","訜","豩","賓","賔","傧","邠","豳","缤","玢","鑌","槟","殡","膑","霦","顮","镔","髕",
    "髩","鬂","鬢","髌","鬓",":bin"
    ,"並","仌","仒","併","倂","偋","傡","垪","寎","幷","庰","怲","抦","掤","昞","昺","栟","栤","梹","棅",
    "氷","燷","琕","癛","癝","眪","兵","冰","柄","丙","秉","饼","炳","病","并","稟","窉","竝","綆","苪",
    "蛃","誁","禀","邴","摒","鈵","鉼","鋲","陃","靐","鞆","餅","餠","疒",":bing"
    ,"仢","侼","僠","僰","噃","嚗","壆","孹","嶓","帗","彴","愽","懪","挬","撥","桲","檘","欂","浡","淿",
    "湐","煿","牔","犦","犻","狛","猼","瓝","瓟","癶","盋","玻","菠","播","拨","钵","波","博","勃","搏",
    "铂","箔","伯","帛","舶","脖","膊","渤","泊","驳","卜","碆","磻","礡","秡","穛","箥","簙","糪","紴",
    "缽","肑","胉","艊","苩","茀","葧","蔔","蔢","蘗","蚾","袚","袯","袹","襎","襮","譒","豰","孛","亳",
    "蹳","郣","啵","鈸","饽","鉑","鉢","鋍","鎛","鑮","镈","檗","擘","礴","钹","餑","餺","鹁","馎","馛",
    "馞","駁","駮","驋","髆","髉","簸","趵","跛","踣","鱍","鵓",":bo"
    ,"佈","勏","吥","咘","埗","尃","峬","庯","廍","悑","抪","捗","擈","柨","歨","歩","獛","捕","哺","补",
    "埠","不","布","步","簿","部","怖","秿","箁","篰","荹","蔀","補","誧","踄","輹","轐","卟","郶","鈈",
    "鈽","逋","陠","瓿","晡","钚","钸","餔","餢","鯆","醭","鳪","鵏","鸔",":bu"
    ,"攃","擦","礸","遪","礤",":ca"
    ,"倸","偲","埰","婇","寀","戝","採","揌","棌","猜","裁","材","才","财","睬","踩","采","彩","菜","蔡",
    "綵","縩","財","跴",":cai"
    ,"乲",":cal"
    ,"傪","儏","參","喰","噆","嬠","嵾","慘","慙","慚","憯","殘","湌","澯","燦","爘","餐","参","蚕","残",
    "惭","惨","灿","薒","蝅","蠶","蠺","謲","骖","璨","飡","飱","驂","粲","黪","黲",":can"
    ,"倉","凔","嵢","欌","滄","濸","獊","苍","舱","仓","沧","藏","罉","艙","蒼","螥","賶","鑶",":cang"
    ,"嶆","愺","慅","慒","懆","撡","曺","操","糙","槽","曹","草","肏","艸","蓸","褿","襙","艹","鄵","嘈",
    "漕","鏪","騲","螬","艚",":cao"
    ,"側","冊","厠","墄","廁","惻","憡","拺","敇","測","厕","策","侧","册","测","筞","箣","粣","荝","萗",
    "萴","蓛","刂","恻",":ce"
    ,"梣","硶","膥","岑","涔",":cen"
    ,"層","层","蹭","竲","曾","噌","驓",":ceng"
    ,"侘","偛","剎","嗏","垞","奼","嵖","扠","査","疀","插","叉","茬","茶","查","碴","搽","察","岔","差",
    "诧","紁","肞","臿","艖","芆","褨","訍","詫","嚓","猹","銟","汊","鍤","鎈","姹","鑔","杈","槎","檫",
    "靫","锸","镲","衩",":cha"
    ,"儕","喍","囆","犲","拆","柴","豺","祡","蠆","袃","侪","釵","钗","瘥","虿",":chai"
    ,"丳","儃","儳","刬","剗","剷","劖","嚵","囅","墠","壥","嬋","嵼","巉","幝","幨","懴","懺","摌","摲",
    "摻","攙","旵","梴","棎","毚","浐","湹","滻","潹","瀍","瀺","灛","煘","燀","獑","產","産","搀","掺",
    "蝉","馋","谗","缠","铲","产","阐","颤","硟","磛","禪","簅","緾","繟","纏","纒","脠","艬","蕆","蟬",
    "裧","襜","覘","誗","諂","讇","讒","冁","谄","蒇","辿","鄽","酁","醦","廛","忏","鋋","鋓","潺","澶",
    "孱","羼","婵","骣","鏟","鑱","镵","閳","闡","觇","禅","韂","顫","饞","蟾","躔",":chan"
    ,"倀","僘","償","兏","嘗","嚐","場","尙","廠","悵","晿","暢","棖","椙","淐","玚","琩","瑺","瓺","甞",
    "畼","昌","猖","场","尝","常","偿","肠","厂","敞","畅","唱","倡","腸","膓","萇","蟐","裮","誯","伥",
    "鬯","苌","菖","徜","怅","惝","阊","鋹","鋿","錩","娼","嫦","鏛","锠","閶","昶","氅","韔","鯧","鲳",
    "鱨","鲿","鼚",":chang"
    ,"仦","巐","巣","弨","樔","欩","漅","煼","牊","眧","超","抄","钞","朝","嘲","潮","巢","吵","炒","绰",
    "窲","粆","綤","綽","繛","罺","觘","趠","轈","鄛","鈔","怊","晁","焯","耖","麨",":chao"
    ,"偖","勶","唓","喢","徹","撦","烢","爡","瞮","硨","硩","车","扯","撤","掣","彻","澈","聅","莗","蛼",
    "坼","車","迠","砗","頙",":che"
    ,"傖","嚫","塵","墋","夦","揨","敐","曟","棽","樄","瀋","烥","煁","疢","瘎","郴","臣","辰","尘","晨",
    "忱","沉","陈","趁","衬","磣","綝","茞","莐","蔯","薼","螴","襯","訦","諃","諶","讖","伧","賝","贂",
    "趻","谌","谶","踸","抻","嗔","宸","琛","榇","陳","霃","碜","龀","鷐","麎","齓","齔",":chen"
    ,"乗","偁","堘","塖","娍","宬","峸","庱","悜","憆","懲","挰","掁","摚","撐","棦","椉","橕","檉","檙",
    "泟","洆","浾","溗","瀓","爯","牚","珹","琤","畻","睈","碀","撑","称","城","橙","成","呈","乘","程",
    "惩","澄","诚","承","逞","骋","秤","稱","窚","竀","筬","絾","緽","脭","荿","蟶","誠","丞","赪","赬",
    "埕","郕","鋮","鏳","鏿","鐺","枨","柽","阷","塍","靗","頳","瞠","铖","铛","饓","裎","騁","騬","蛏",
    "鯎","酲",":cheng"
    ,"侙","勅","卶","叺","呎","垑","妛","岻","彨","彲","恜","恥","慗","憏","懘","抶","摛","摴","攡","杘",
    "欼","歗","歯","淔","湁","灻","烾","熾","瓻","痓","痸","癡","瞝","吃","痴","持","池","迟","弛","驰",
    "耻","齿","侈","尺","赤","翅","斥","炽","竾","筂","翄","翤","翨","肔","胣","腟","蚇","蚳","裭","訵",
    "謘","貾","傺","趩","墀","茌","遅","遫","遲","叱","哧","啻","嗤","彳","饬","鉓","鉹","媸","雴","敕",
    "眵","飭","餝","饎","鸱","馳","瘛","褫","蚩","螭","笞","篪","豉","踟","魑","鴟","鵄","鶒","鷘","麶",
    "黐","齒","齝",":chi"
    ,"傭","嘃","埫","寵","崈","憃","摏","沖","浺","珫","充","冲","虫","崇","宠","罿","翀","蟲","衝","褈",
    "蹖","茺","忡","銃","憧","隀","铳","舂","艟",":chong"
    ,"丒","侴","儔","吜","嬦","懤","掫","擣","杽","栦","殠","燽","犨","犫","疇","皗","矁","抽","酬","畴",
    "踌","稠","愁","筹","仇","绸","瞅","丑","臭","篘","籌","紬","絒","綢","菗","讎","讐","俦","跾","躊",
    "遚","酧","醜","惆","雔","瘳","魗","雠",":chou"
    ,"俶","傗","儊","儲","処","媰","岀","幮","廚","懨","拀","敊","斶","椘","榋","橻","檚","櫉","櫥","歜",
    "濋","犓","珿","琡","璴","初","出","橱","厨","躇","锄","雏","滁","除","楚","础","储","矗","搐","触",
    "处","礎","禇","竌","竐","篨","絀","耡","臅","蒢","蒭","處","蟵","畜","觕","觸","豖","豠","貙","亍",
    "趎","踀","刍","躕","鄐","怵","鉏","憷","鋤","屮","绌","杵","楮","閦","樗","雛","褚","蜍","蹰","黜",
    "鶵","齣","齭","齼",":chu"
    ,"揣","膗","搋","嘬","膪","踹",":chuai"
    ,"傳","僢","剶","堾","暷","歂","汌","猭","玔","瑏","甎","川","穿","椽","传","船","喘","串","荈","賗",
    "踳","輲","釧","舛","遄","巛","氚","钏","舡",":chuan"
    ,"仺","傸","刅","刱","剏","剙","創","噇","愴","摐","漺","牀","牎","牕","瘡","磢","疮","窗","床","闯",
    "创","窓","窻","怆","闖",":chuang"
    ,"圌","桘","吹","炊","捶","锤","垂","箠","菙","陲","錘","棰","槌","顀","龡",":chui"
    ,"偆","媋","惷","旾","暙","杶","槆","橁","櫄","浱","滣","漘","犉","瑃","睶","春","椿","醇","唇","淳",
    "纯","蠢","箺","純","脣","萅","萶","蒓","賰","輴","莼","醕","陙","鹑","蝽","鯙","鰆","鶉","鶞",":chun"
    ,"嚽","娕","娖","婼","惙","擉","歠","涰","磭","戳","輟","辵","逴","啜","酫","鋜","鑡","辍","踔","龊",
    "齪","齱",":chuo"
    ,"佌","佽","偨","刾","垐","嬨","庛","朿","枱","柌","栨","濨","玼","珁","甆","皉","疵","茨","磁","雌",
    "辞","慈","瓷","词","此","刺","赐","次","礠","絘","縒","茦","莿","蛓","螆","詞","賜","趀","跐","辝",
    "辤","辭","呲","鈶","祠","飺","餈","鹚","髊","糍","鴜","鶿","鷀","齹",":ci"
    ,"嗭",":cis"
    ,"叢","囪","婃","孮","従","徖","從","忩","怱","悤","悰","憁","暰","棇","楤","樅","樬","樷","欉","漎",
    "漗","灇","焧","爜","瑽","瞛","聪","葱","囱","匆","从","丛","篵","繱","聡","聦","聰","茐","蔥","藂",
    "蟌","誴","謥","賨","賩","苁","淙","骢","鏦","琮","璁","枞","騘","驄",":cong"
    ,"湊","凑","輳","楱","辏","腠",":cou"
    ,"媨","憱","瘄","瘯","粗","醋","簇","促","縬","蔖","誎","趗","蹵","蔟","徂","猝","殂","顣","蹙","蹴",
    "麁","麄","麤","鼀",":cu"
    ,"巑","攅","攛","攢","櫕","殩","熶","蹿","篡","窜","竄","篹","簒","汆","躥","撺","鑹","爨","镩",":cuan"
    ,"乼","凗","啛","墔","忰","慛","漼","焠","熣","獕","琗","疩","皠","磪","摧","崔","催","脆","瘁","粹",
    "淬","翠","竁","粋","繀","翆","脃","脺","膬","膵","臎","萃","啐","悴","鏙","璀","榱","毳",":cui"
    ,"刌","澊","村","存","寸","竴","籿","邨","忖","皴",":cun"
    ,"剉","剒","夎","嵳","棤","瑳","磋","撮","搓","措","挫","错","莝","莡","蒫","蓌","虘","襊","厝","逪",
    "遳","醝","嵯","銼","錯","脞","锉","矬","痤","鹾","蹉","鹺",":cuo"
    ,"亣","剳","匒","咑","噠","垯","墶","搨","撘","橽","汏","溚","炟","燵","畣","眔","矺","搭","达","答",
    "瘩","打","大","笚","繨","羍","荅","荙","薘","蟽","觰","詚","跶","躂","迏","迖","耷","逹","達","哒",
    "嗒","怛","鎉","鎝","妲","鐽","韃","疸","褡","笪","靼","鞑","龖","龘",":da"
    ,"侢","叇","垈","帒","帯","帶","廗","懛","曃","柋","瀻","獃","瑇","呆","歹","傣","戴","带","殆","代",
    "贷","袋","待","逮","怠","箉","簤","紿","緿","艜","蚮","蝳","螮","襶","貸","跢","蹛","軑","軚","埭",
    "軩","轪","甙","岱","迨","骀","绐","玳","霴","靆","鮘","黛","鴏","黱",":dai"
    ,"丼","亶","伔","倓","僤","刐","勯","匰","単","啗","啿","單","嘾","噉","噡","嚪","妉","娊","媅","帎",
    "弾","彈","惔","愖","憚","憺","抌","撢","撣","擔","柦","殫","沊","泹","澸","狚","玬","瓭","甔","疍",
    "癉","癚","砃","耽","担","丹","单","郸","掸","胆","旦","氮","但","惮","淡","诞","弹","蛋","禫","窞",
    "簞","紞","繵","耼","聸","腅","膽","蜑","蟺","衴","褝","襌","觛","誕","譂","亻","賧","贉","儋","卩",
    "躭","萏","鄲","啖","酖","醈","澹","殚","赕","霮","眈","頕","餤","饏","瘅","馾","駳","聃","髧","箪",
    "鴠","黕","黮","黵",":dan"
    ,"偒","儅","噹","圵","垱","壋","嵣","愓","擋","檔","欓","氹","潒","澢","灙","珰","璗","璫","瓽","當",
    "盪","瞊","碭","礑","当","挡","党","荡","档","筜","簜","簹","艡","蕩","蘯","蟷","襠","譡","讜","趤",
    "谠","凼","菪","逿","宕","闣","雼","砀","裆","黨",":dang"
    ,"噵","壔","宲","導","屶","島","嶋","嶌","嶹","幬","捯","搗","椡","槝","檤","瓙","盜","禂","刀","捣",
    "蹈","倒","岛","祷","导","到","稻","悼","道","盗","禱","稲","箌","翢","翿","舠","菿","虭","衜","衟",
    "裯","軇","叨","帱","釖","忉","陦","隝","隯","氘","魛","纛","鱽",":dao"
    ,"嘚","徳","恴","悳","惪","棏","淂","德","得","的","鍀","锝",":de"
    ,"扥","扽",":den"
    ,"僜","墱","嬁","櫈","澂","燈","璒","蹬","灯","登","等","瞪","凳","邓","竳","艠","覴","豋","鄧","噔",
    "嶝","鐙","戥","隥","磴","镫","簦",":deng"
    ,"仾","俤","偙","僀","厎","呧","唙","啇","啲","嚁","坔","坘","埊","埞","墆","墑","墬","奃","媂","嵽",
    "嶳","廸","弔","弚","弤","彽","怟","慸","拞","掋","揥","摕","敵","旳","杕","枤","梊","梑","樀","泜",
    "渧","滌","焍","牴","玓","珶","甋","疐","眱","碮","磾","祶","堤","低","滴","迪","敌","笛","狄","涤",
    "嫡","抵","底","地","蒂","第","帝","弟","递","缔","禘","篴","糴","締","聜","腣","苐","苖","菂","菧",
    "蔋","蔐","蔕","藋","藡","蝃","袛","覿","詆","諟","諦","豴","氐","籴","赿","趆","诋","谛","踧","踶",
    "蹏","蹢","邸","坻","軧","荻","逓","遞","遰","嘀","釱","鉪","鍉","娣","鏑","柢","棣","阺","隄","觌",
    "靮","鞮","砥","碲","睇","頔","镝","馰","髢","鬄","魡","羝","鯳","骶","鸐",":di"
    ,"嗲",":dia"
    ,"傎","厧","唸","嚸","墊","壂","奌","婝","婰","嵮","巓","巔","扂","攧","敁","敟","椣","槇","槙","橂",
    "橝","澱","琔","痶","瘨","癲","磹","颠","掂","滇","碘","点","典","靛","垫","电","佃","甸","店","惦",
    "奠","淀","殿","腍","蒧","蕇","蜔","丶","蹎","坫","巅","鈿","玷","電","顚","顛","钿","癜","癫","驔",
    "簟","踮","點","齻",":dian"
    ,"伄","刟","奝","嬥","屌","弴","彫","扚","殦","汈","淍","琱","瘹","矵","碉","叼","雕","凋","刁","掉",
    "吊","钓","调","窎","窵","竨","簓","絩","蛁","訋","誂","調","釣","鈟","銱","鋽","錭","鑃","雿","铞",
    "颩","鮉","鯛","貂","鲷","鳭","鵃","鵰","鸼","鼦",":diao"
    ,"啑","峌","崼","幉","怢","恎","惵","戜","挃","曡","柣","槢","殜","氎","渉","牃","畳","疂","疉","疊",
    "眣","眰","跌","爹","碟","蝶","迭","谍","叠","絰","绖","耊","胅","臷","艓","苵","蜨","螲","褋","褺",
    "詄","諜","趃","跕","跮","垤","堞","揲","喋","鐡","镻","牒","瓞","耋","鮙","蹀","鰈","鲽",":die"
    ,"奵","嵿","帄","忊","掟","椗","濎","甼","矴","碠","磸","丁","盯","叮","钉","顶","鼎","锭","定","订",
    "聢","艼","萣","薡","虰","訂","仃","啶","釘","鋌","錠","鐤","玎","腚","靪","頂","碇","顁","町","铤",
    "飣","饤","疔","耵","酊","鼑",":ding"
    ,"丟","丢","銩","铥",":diu"
    ,"倲","働","凍","動","勭","埬","墥","姛","娻","嬞","峝","崠","崬","徚","戙","挏","揰","昸","東","棟",
    "氭","涷","湩","烔","狫","东","冬","董","懂","动","栋","侗","恫","冻","洞","笗","箽","絧","腖","苳",
    "菄","蕫","蝀","衕","詷","諌","垌","迵","咚","岽","峒","夂","霘","氡","胨","胴","硐","鸫","駧","騆",
    "鮗","鯟","鶇","鶫","鼕",":dong"
    ,"乧","侸","兠","凟","剅","吺","唗","唞","斣","枓","梪","橷","毭","浢","瞗","兜","抖","斗","陡","豆",
    "逗","痘","都","竇","脰","艔","荳","蔸","郖","酘","鈄","鋀","閗","闘","阧","餖","饾","窦","蚪","篼",
    "鬥","鬦","鬪","鬬","鬭",":dou"
    ,"剢","剫","匵","厾","叾","妬","嬻","帾","晵","暏","樚","櫝","殬","殰","涜","瀆","牘","犢","獨","琽",
    "瓄","皾","秺","督","毒","犊","独","读","堵","睹","赌","杜","镀","肚","度","渡","妒","笁","篤","荰",
    "螙","蠧","裻","襡","襩","覩","読","讀","讟","豄","賭","贕","芏","嘟","醏","渎","錖","鍍","鑟","椟",
    "闍","阇","陼","牍","靯","韇","韣","韥","騳","蠹","笃","髑","黩","黷",":du"
    ,"偳","剬","塅","媏","斷","毈","煆","瑖","碫","端","短","锻","段","断","缎","篅","籪","緞","腶","葮",
    "褍","躖","鍛","鍴","椴","煅","簖",":duan"
    ,"兊","兌","垖","埻","塠","対","對","嵟","憞","懟","搥","杸","濧","瀩","痽","磓","祋","堆","兑","队",
    "对","綐","薱","謉","譈","譵","鋭","錞","鎚","鐜","陮","隊","怼","憝","碓","頧","镦","鴭",":dui"
    ,"伅","噸","墪","壿","庉","惇","撉","撴","楯","橔","潡","燉","犜","獤","碷","墩","吨","蹲","敦","顿",
    "囤","钝","盾","遁","腞","腯","蜳","踲","蹾","躉","逇","遯","鈍","沌","鐓","炖","砘","礅","盹","頓",
    "驐","趸",":dun"
    ,"亸","仛","凙","刴","剟","吋","喥","嚉","嚲","垜","埵","墮","墯","夛","奪","奲","媠","嫷","尮","崜",
    "嶞","憜","挅","挆","敓","敚","敠","敪","朶","柮","桗","椯","橢","毲","沰","痥","硾","掇","哆","多",
    "夺","垛","躲","朵","跺","舵","剁","惰","堕","綞","茤","詑","貀","趓","跥","跿","躱","咄","哚","鈬",
    "沲","缍","鐸","陊","陏","隓","铎","飿","饳","駄","裰","鬌","鮵","踱","鵽",":duo"
    ,"佮","偔","僫","匎","匼","卾","吪","呝","咢","咹","啈","囮","堊","堮","妸","妿","姶","娿","屵","岋",
    "峉","峩","崿","廅","悪","惡","戹","搕","搤","搹","擜","枙","櫮","欸","歞","歺","涐","湂","玀","珴",
    "琧","皒","睋","砈","砐","砨","砵","硆","磀","礘","蛾","峨","鹅","俄","额","讹","娥","恶","厄","扼",
    "遏","鄂","饿","蕚","蘁","蚅","蝁","襨","覨","訛","詻","誐","諤","譌","讍","豟","噩","谔","垩","軛",
    "苊","軶","莪","萼","迗","遌","遻","呃","鈋","鈪","愕","阏","鋨","鍔","婀","鑩","閜","轭","阨","阸",
    "腭","頞","頟","額","顎","锇","锷","餓","餩","鹗","騀","颚","魤","魥","鰐","鰪","鳄","鱷","鵈","鵝",
    "鵞","鶚","齃","齶","齾",":e"
    ,"誒","诶",":ei"
    ,"奀","峎","煾","恩","蒽","摁","唔","嗯",":en"
    ,"鞥",":eng"
    ,"侕","児","兒","刵","咡","唲","嬭","尒","尓","峏","弍","弐","杒","栭","栮","樲","毦","洏","爾","而",
    "儿","耳","尔","饵","洱","二","贰","粫","耏","聏","胹","荋","薾","衈","袻","誀","貮","貳","佴","趰",
    "輀","輭","轜","邇","鉺","迩","珥","陑","陾","隭","铒","餌","鸸","駬","髵","髶","鮞","鲕","鴯",":er"
    ,"佱","傠","姂","彂","栰","橃","汎","沷","浌","灋","琺","発","發","瞂","发","罚","筏","伐","乏","阀",
    "法","珐","罰","罸","蕟","藅","垡","醗","鍅","閥","砝","髪","髮",":fa"
    ,"仮","伋","凢","凣","勫","匥","墦","奿","婏","嬎","嬏","嬔","忛","憣","払","旙","旛","杋","柉","棥",
    "橎","氾","渢","滼","瀪","瀿","煩","犿","璠","盕","礬","藩","帆","番","翻","樊","矾","钒","繁","凡",
    "烦","反","返","范","贩","犯","饭","泛","笲","笵","範","籵","緐","繙","羳","舤","舧","舩","薠","蠜",
    "訉","販","軓","軬","轓","辺","蕃","蘩","幡","犭","釩","鐇","梵","攵","燔","畈","颿","飜","飯","飰",
    "蹯","鱕","鷭",":fan"
    ,"倣","埅","堏","旊","昉","昘","淓","牥","瓬","眆","坊","芳","方","肪","房","防","妨","仿","访","纺",
    "放","紡","訪","邡","鈁","錺","枋","钫","髣","魴","舫","鲂","鴋","鶭",":fang"
    ,"俷","剕","厞","奜","婓","婔","屝","廃","廢","昲","暃","曊","朏","柹","棐","櫠","渄","濷","猆","疿",
    "癈","菲","非","啡","飞","肥","匪","诽","吠","肺","废","沸","费","笰","紼","緋","胏","胐","萉","蕜",
    "蕡","蜰","蟦","裶","襏","誹","費","芾","狒","悱","淝","妃","鐨","绯","榧","腓","靅","靟","斐","扉",
    "飛","飝","镄","餥","痱","馡","騑","騛","蜚","髴","篚","翡","鯡","霏","鲱","鼣",":fei"
    ,"僨","坋","墳","奮","妢","岎","帉","幩","弅","憤","昐","朆","枌","梤","棻","橨","燓","瞓","秎","芬",
    "酚","吩","氛","分","纷","坟","焚","汾","粉","奋","份","忿","愤","粪","竕","糞","紛","羒","羵","翂",
    "膹","蒶","蚠","蚡","豮","豶","偾","躮","轒","鈖","錀","瀵","鐼","棼","隫","雰","餴","饙","馚","馩",
    "魵","鲼","鱝","鼢","黂","黺","鼖",":fen"
    ,"仹","偑","僼","凨","凬","凮","堸","妦","寷","峯","崶","捀","桻","楓","檒","沨","浲","湗","溄","灃",
    "焨","煈","犎","猦","琒","甮","瘋","盽","碸","丰","封","枫","蜂","峰","锋","风","疯","烽","逢","冯",
    "缝","讽","奉","凤","篈","綘","縫","艂","蘕","蘴","諷","豊","豐","賵","俸","赗","酆","葑","唪","鄷",
    "沣","鋒","鎽","鏠","靊","砜","風","飌","馮","鳯","鳳","鴌","麷",":feng"
    ,"覅",":fiao"
    ,"仏","坲","梻","佛",":fo"
    ,"垺","否","紑","缹","缻","芣","雬","缶","鴀",":fou"
    ,"乀","乶","伕","俌","偩","冨","冹","刜","咈","哹","坿","垘","姇","娐","婦","媍","岪","峊","弣","彿",
    "復","怤","懯","捬","撫","旉","枎","柎","柫","栿","棴","椨","椱","榑","汱","泭","洑","澓","炥","烰",
    "焤","玞","玸","琈","璷","甶","畉","畗","癁","盙","砆","祔","禣","稪","夫","敷","肤","孵","扶","拂",
    "辐","幅","氟","符","伏","俘","服","竎","浮","涪","福","袱","弗","甫","抚","辅","俯","釜","斧","腑",
    "府","腐","赴","副","覆","赋","复","傅","付","阜","父","腹","负","富","讣","附","妇","缚","咐","筟",
    "箙","簠","粰","糐","紨","紱","絥","綍","綒","緮","縛","罦","翇","胕","膚","艀","荂","荴","萯","葍",
    "蕧","虙","蚥","蚹","蛗","蝜","衭","袝","複","褔","覄","訃","詂","諨","豧","負","賦","賻","匐","凫",
    "郛","芙","苻","茯","軵","輔","輻","菔","拊","邚","邞","呋","郙","鄜","酜","酻","釡","幞","鈇","怫",
    "鉘","鉜","滏","鍑","鍢","艴","孚","驸","绂","绋","桴","赙","祓","韍","韨","砩","黻","黼","罘","颫",
    "稃","馥","駙","蚨","蜉","蝠","蝮","鬴","麸","鮄","鮒","鮲","趺","跗","鰒","鲋","鳆","鳧","鳬","鳺",
    "鴔","鵩","麩","麬","麱",":fu"
    ,"嘠","夾","玍","噶","嘎","伽","尬","呷","釓","錷","尕","尜","旮","钆","魀",":ga"
    ,"乢","侅","匃","匄","姟","峐","忋","摡","晐","槩","槪","漑","瓂","畡","祴","该","改","概","钙","盖",
    "溉","絠","絯","荄","葢","蓋","該","豥","丐","賅","賌","陔","垓","郂","鈣","鎅","戤","赅",":gai"
    ,"乹","亁","仠","佄","倝","凎","凲","尲","尶","尷","幹","忓","扜","扞","攼","桿","檊","汵","漧","灨",
    "玕","皯","盰","稈","干","甘","杆","柑","竿","肝","赶","感","秆","敢","赣","笴","筸","篢","簳","粓",
    "紺","芉","虷","衦","詌","諴","豃","贑","贛","趕","坩","苷","迀","尴","擀","釬","泔","淦","澉","錎",
    "绀","橄","旰","矸","飦","疳","骭","魐","酐","鰔","鱤","鳡","鳱",":gan"
    ,"冮","剛","堈","堽","岡","崗","戅","戇","掆","棡","槓","焵","牨","犅","犺","疘","矼","冈","刚","钢",
    "缸","肛","纲","岗","港","杠","綱","罁","罓","釭","鋼","鎠","阬","戆","頏","罡","筻",":gang"
    ,"勂","吿","夰","峼","暠","槀","槹","橰","檺","櫜","滜","澔","獋","獔","皐","祮","祰","禞","稁","稾",
    "篙","皋","高","膏","羔","糕","搞","镐","稿","告","筶","縞","臯","菒","藳","誥","睾","诰","郜","藁",
    "鋯","鎬","缟","槔","槁","杲","韟","锆","餻","髙","鷎","鷱","鼛",":gao"
    ,"佫","個","匌","吤","呄","嗰","嘅","彁","愅","戓","戨","挌","擱","敋","杚","槅","櫊","滆","滒","牫",
    "牱","犵","猲","獦","秴","哥","歌","搁","戈","鸽","胳","疙","割","革","葛","格","阁","隔","铬","个",
    "各","箇","紇","咯","肐","臵","裓","觡","詥","諽","謌","鬲","哿","圪","塥","轕","嗝","鉻","鎘","鎶",
    "纥","閣","閤","搿","膈","鞈","鞷","韐","韚","硌","镉","袼","騔","虼","舸","鮯","鲄","骼","鴐","鴚",
    "鴿",":ge"
    ,"给","給",":gei"
    ,"亙","揯","搄","根","跟","亘","茛","哏","艮",":gen"
    ,"刯","堩","峺","挭","掶","暅","椩","浭","焿","畊","耕","更","庚","羹","埂","耿","梗","絙","絚","緪",
    "縆","莄","菮","賡","哽","郉","郠","赓","绠","骾","鯁","鲠","鶊","鹒",":geng"
    ,"怾",":gi"
    ,"匑","匔","厷","唝","嗊","塨","宮","幊","愩","慐","拲","杛","栱","渱","熕","碽","工","攻","功","恭",
    "龚","供","躬","公","宫","弓","巩","汞","拱","贡","共","糼","羾","觵","貢","躳","輁","銾","珙","肱",
    "鞏","蚣","髸","魟","觥","龔",":gong"
    ,"傋","冓","坸","夠","姤","抅","搆","撀","構","泃","溝","煹","玽","钩","勾","沟","苟","狗","垢","构",
    "购","够","簼","緱","耇","耈","耉","茩","蚼","袧","褠","覯","訽","詬","豿","佝","購","诟","軥","岣",
    "鈎","鉤","遘","媾","缑","枸","觏","雊","彀","笱","篝","鞲","鴝","鸜",":gou"
    ,"傦","僱","凅","唂","唃","啒","嗀","堌","嫴","尳","峠","崓","怘","愲","扢","抇","柧","棝","榖","榾",
    "橭","泒","淈","濲","瀔","焸","皷","盬","硲","祻","稒","笟","箛","辜","菇","咕","箍","估","沽","孤",
    "姑","鼓","古","蛊","骨","谷","股","故","顾","固","雇","篐","糓","縎","罛","羖","脵","苽","蓇","薣",
    "蛌","詁","嘏","诂","軱","軲","轂","菰","逧","崮","鈷","汩","錮","梏","轱","牯","牿","臌","毂","頋",
    "顧","瞽","罟","钴","锢","餶","馉","鸪","痼","蛄","酤","鮕","觚","鯝","鲴","鹘","鴣","鶻","鼔",":gu"
    ,"冎","剮","劀","叧","啩","坬","掛","歄","焻","煱","刮","瓜","剐","寡","挂","褂","絓","緺","罣","罫",
    "詿","諣","卦","趏","诖","呱","銽","栝","胍","颪","鸹","騧","鴰",":gua"
    ,"叏","夬","恠","枴","柺","乖","拐","怪",":guai"
    ,"丱","卝","悹","悺","慣","懽","摜","樌","毌","泴","潅","爟","瓘","痯","瘝","癏","矔","礶","祼","窤",
    "筦","棺","关","官","冠","观","管","馆","罐","惯","灌","贯","罆","舘","萖","蒄","覌","観","觀","貫",
    "倌","躀","輨","掼","遦","涫","錧","鏆","鑵","關","雚","盥","館","鹳","鰥","鱞","鱹","鳏","鳤","鸛",":guan"
    ,"侊","俇","僙","垙","姯","広","廣","挄","撗","櫎","欟","洸","灮","炗","炚","炛","烡","獷","珖","硄",
    "光","广","逛","臦","臩","茪","趪","輄","咣","犷","銧","桄","胱","黆",":guang"
    ,"亀","佹","劊","劌","匭","厬","垝","媯","嫢","嬀","嶡","嶲","巂","帰","庪","摫","撌","攰","攱","昋",
    "朹","椝","椢","槣","槶","槻","槼","檜","櫃","櫰","櫷","歸","氿","湀","潙","猤","珪","璝","瓌","瞆",
    "瞡","瞶","祪","禬","筀","瑰","规","圭","硅","归","龟","闺","轨","鬼","诡","癸","桂","柜","跪","贵",
    "刽","絵","傀","胿","膭","茥","蓕","蛫","螝","蟡","袿","襘","規","觤","詭","匦","刿","貴","赽","趹",
    "軌","邽","郌","庋","宄","妫","桧","閨","陒","炅","晷","雟","鞼","皈","簋","鬶","鬹","鮭","鲑","鱖",
    "鱥","鳜","鴂","鴃","龜",":gui"
    ,"惃","棞","滾","琯","璭","睔","睴","辊","滚","棍","緄","蓘","蔉","袞","謴","衮","輥","绲","磙","鮌",
    "鯀","鲧",":gun"
    ,"啯","嘓","囯","囶","囻","圀","國","墎","幗","彉","彍","惈","慖","摑","楇","槨","淉","漍","瘑","矌",
    "锅","郭","国","果","裹","过","簂","粿","綶","聝","腘","膕","菓","蔮","褁","馘","埚","輠","掴","過",
    "呙","帼","崞","鈛","猓","錁","鍋","鐹","椁","虢","餜","馃","聒","蜾","蝈",":guo"
    ,"妎","蛤","哈","鉿","铪",":ha"
    ,"嗐","嚡","塰","烸","骸","孩","海","氦","亥","害","骇","还","還","酼","胲","餀","饚","駭","駴","醢",":hai"
    ,"傼","兯","凾","厈","咁","哻","唅","圅","娢","崡","嵅","晘","晥","暵","梒","椷","榦","欦","浛","浫",
    "涆","漢","澏","澣","熯","爳","猂","琀","甝","皔","睅","筨","酣","憨","邯","韩","含","涵","寒","函",
    "喊","罕","翰","撼","捍","旱","憾","悍","焊","汗","汉","糮","肣","莟","蔊","蛿","蜬","蜭","螒","譀",
    "谽","邗","菡","撖","銲","鋎","鋡","瀚","晗","雗","焓","韓","頷","顄","馠","馯","顸","駻","颔","蚶",
    "鬫","魽","鼾","鶾",":han"
    ,"垳","斻","笐","筕","杭","航","絎","苀","蚢","行","貥","迒","沆","绗","颃","魧",":hang"
    ,"傐","儫","呺","哠","嘷","噑","恏","悎","昦","晧","暤","暭","曍","椃","淏","滈","灝","獆","皜","皞",
    "皡","皥","竓","壕","嚎","豪","毫","郝","好","耗","号","浩","籇","聕","茠","薃","藃","號","虠","蠔",
    "諕","譹","蒿","薅","鄗","嗥","嚆","濠","灏","昊","顥","皓","颢","蚝","鰝",":hao"
    ,"咊","哬","啝","嗃","垎","姀","寉","峆","惒","抲","敆","柇","楁","欱","渮","湼","澕","焃","煂","熆",
    "熇","燺","爀","癋","皬","盇","盉","碋","礉","篕","呵","喝","荷","菏","核","禾","和","何","合","盒",
    "阂","河","涸","赫","褐","鹤","贺","籺","粭","翯","萂","螛","蠚","覈","訶","訸","謞","賀","诃","劾",
    "壑","嗬","鉌","阖","鑉","闔","曷","隺","靍","靎","靏","鞨","頜","盍","餄","饸","颌","魺","翮","鶡",
    "鶮","鶴","鸖","鹖","麧","齕","龁","龢",":he"
    ,"嬒","潶","嘿","黑","嗨","黒",":hei"
    ,"佷","噷","拫","痕","很","狠","恨","詪","鞎",":hen"
    ,"堼","姮","恆","悙","橫","涥","烆","哼","亨","横","衡","恒","胻","脝","蘅","珩","鑅","桁","鴴","鵆",
    "鸻",":heng"
    ,"仜","叿","吰","嚝","垬","妅","娂","宖","彋","揈","撔","晎","汯","浤","渹","潂","澋","澒","灴","焢",
    "玒","玜","瓨","硔","硡","竑","竤","篊","轰","哄","烘","虹","鸿","洪","宏","弘","红","粠","紅","紘",
    "紭","綋","纮","翃","翝","耾","舼","苰","葒","葓","訌","谹","谼","黉","訇","讧","軣","輷","荭","轟",
    "蕻","薨","鈜","鉷","闳","泓","鋐","鍧","閎","閧","闀","闂","霐","霟","鞃","鴻","黌",":hong"
    ,"呴","垕","帿","洉","犼","睺","矦","喉","侯","猴","吼","厚","候","后","翭","翵","腄","葔","豞","堠",
    "郈","鄇","後","銗","逅","鍭","餱","瘊","篌","糇","鮜","鯸","鲎","鱟","鲘","骺",":hou"
    ,"乕","乯","俿","冴","匢","匫","喖","嘑","嘝","垀","壷","壺","婟","媩","嫭","嫮","寣","帍","弖","戯",
    "戱","戶","戸","摢","昈","昒","曶","枑","楜","槴","歑","汻","沍","泘","淴","滬","滸","濩","瀫","焀",
    "熩","瓡","瓳","礐","穫","箎","箶","簄","呼","乎","忽","瑚","壶","葫","胡","蝴","狐","糊","湖","粐",
    "弧","虎","唬","护","互","沪","户","絗","綔","縠","芐","芔","苸","萀","蔛","蔰","虖","虝","螜","衚",
    "觷","謼","護","冱","軤","唿","鄠","囫","岵","猢","怙","惚","鋘","浒","滹","錿","鍙","鍸","琥","槲",
    "轷","雐","雽","觳","烀","煳","戽","扈","祜","韄","頀","頶","餬","瓠","鹄","鹕","鹱","虍","笏","鬍",
    "魱","醐","斛","鯱","鰗","鱯","鳠","鳸","鵠","鶘","鶦","鸌",":hu"
    ,"劃","嘩","埖","夻","姡","婲","婳","嫿","嬅","崋","摦","撶","杹","椛","槬","樺","檴","澅","璍","畫",
    "畵","硴","花","哗","华","猾","滑","画","划","化","话","糀","繣","舙","芲","華","蕐","蘤","蘳","螖",
    "觟","話","誮","諙","譮","錵","骅","鏵","桦","砉","铧","驊","鷨","黊",":hua"
    ,"佪","咶","壊","壞","懐","懷","槐","徊","怀","淮","坏","耲","蘹","蘾","褢","褱","踝",":huai"
    ,"喚","嚾","圂","堚","奐","寏","峘","嵈","愌","懁","換","攌","梙","槵","歓","歡","渙","澴","烉","煥",
    "狟","瑍","環","瘓","睆","瞏","瞣","欢","环","桓","缓","换","患","唤","痪","豢","焕","涣","宦","幻",
    "糫","綄","緩","繯","羦","肒","荁","萈","藧","蠸","讙","豲","貆","貛","奂","萑","轘","擐","酄","圜",
    "獾","鉮","洹","浣","漶","寰","逭","鍰","缳","鐶","镮","闤","阛","雈","锾","驩","鯇","鯶","鰀","鲩",
    "鬟","鴅","鵍","鹮",":huan"
    ,"偟","兤","喤","堭","塃","墴","奛","媓","宺","崲","巟","怳","愰","晄","曂","楻","榥","滉","炾","熿",
    "獚","瑝","皝","皩","穔","荒","慌","黄","磺","蝗","簧","皇","凰","惶","煌","晃","幌","恍","谎","縨",
    "艎","葟","衁","詤","諻","謊","隍","徨","湟","潢","鍠","遑","鎤","鐄","璜","锽","肓","餭","癀","騜",
    "蟥","篁","鰉","鳇","鱑","鷬","黃",":huang"
    ,"僡","儶","匯","叀","嘒","噅","噕","嚖","囘","囬","圚","婎","媈","孈","寭","屷","幑","廻","廽","彙",
    "彚","徻","恛","恵","憓","懳","拻","揮","暉","暳","會","楎","槥","橞","檅","檓","櫘","毀","毇","泋",
    "洃","滙","潓","澮","瀈","灳","烜","烠","烣","煇","燬","燴","獩","琿","璤","痐","睳","瞺","禈","穢",
    "篲","灰","挥","辉","徽","恢","蛔","回","毁","悔","慧","卉","惠","晦","贿","秽","会","烩","汇","讳",
    "诲","绘","繢","繪","翙","翚","翬","翽","蔧","薈","薉","藱","蛕","蜖","詯","詼","誨","諱","譓","譭",
    "譿","豗","賄","诙","茴","荟","輝","迴","蕙","逥","咴","喙","銊","隳","洄","浍","彗","鏸","鐬","缋",
    "珲","闠","阓","晖","靧","韢","恚","顪","餯","虺","蟪","鮰","鰴","麾",":hui"
    ,"俒","倱","忶","惛","惽","慁","掍","昬","梱","棔","涽","渾","湷","焄","焝","睧","睯","荤","昏","婚",
    "魂","浑","混","繉","葷","蔒","觨","諢","诨","轋","馄","阍","溷","閽","餛","鼲",":hun"
    ,"佸","俰","剨","吙","咟","嚿","奯","捇","掝","搉","擭","旤","曤","沎","湱","瀖","獲","癨","眓","矐",
    "禍","秮","篧","豁","活","伙","火","获","或","惑","霍","货","祸","耯","臛","謋","謔","貨","劐","藿",
    "邩","攉","嚯","鈥","夥","鍃","鑊","閄","靃","钬","锪","镬","耠","騞","蠖",":huo"
    ,"丮","亼","亽","偮","僟","兾","刉","刏","剤","劑","勣","卙","卽","叝","吇","喞","嗘","嘰","嚌","坖",
    "垍","堲","塉","墍","妀","姞","尐","峜","嵆","嶯","帺","幾","庴","廭","彑","彶","徛","忣","惎","愱",
    "憿","懠","懻","揤","撃","撠","擊","擠","攲","敧","旡","旣","暩","曁","枅","梞","楖","極","槉","樭",
    "機","橶","檕","檝","檵","櫅","櫭","毄","汥","泲","淁","済","湒","漃","漈","潗","濈","濟","瀱","焏",
    "犱","狤","璂","璣","璾","畟","痵","癠","癪","皍","硛","磯","禝","禨","稘","稩","穄","穊","積","穖",
    "穧","筓","箿","簊","簎","击","圾","基","机","畸","稽","积","箕","糭","紀","紒","級","肌","饥","迹",
    "激","讥","鸡","姬","绩","缉","吉","极","棘","辑","籍","集","及","急","疾","汲","即","嫉","级","挤",
    "几","脊","己","蓟","技","冀","季","伎","祭","剂","悸","济","寄","寂","计","记","既","忌","际","妓",
    "继","纪","継","緝","縘","績","繋","繫","繼","罽","羇","羈","耤","耭","脨","膌","臮","艥","芶","茍",
    "莋","萕","葪","蔇","蕀","薊","蘎","蘮","蘻","虀","蝍","螏","蟣","蟿","蠀","裚","褀","襀","襋","覉",
    "覊","覬","觙","觭","計","訐","記","誋","諅","諔","譏","譤","谻","谿","丌","亟","乩","剞","賫","賷",
    "佶","偈","趌","跡","踑","踖","踦","蹐","蹟","墼","躋","躤","躸","芨","芰","輯","蒺","轚","蕺","掎",
    "叽","咭","哜","唧","郆","鄿","岌","嵴","銈","銡","洎","錤","鍓","屐","骥","鏶","鐖","畿","玑","鑇",
    "鑙","楫","殛","戟","戢","赍","觊","犄","際","隮","雞","雦","雧","霵","霽","鞊","齑","鞿","韲","矶",
    "羁","颳","飢","嵇","稷","瘠","虮","驥","笈","笄","鬾","魝","魢","暨","鮆","鯚","跻","跽","鯯","鯽",
    "鰶","霁","鲚","鲫","鰿","鱀","鱭","鱾","髻","麂","鳮","鵋","鶏","鶺","鷄","鷑","鸄","鹡","齌","齍",
    "齎","齏",":ji"
    ,"乫","價","叚","唊","圿","埉","夓","婽","幏","徦","忦","戞","扴","抸","挾","斚","斝","梜","椵","榎",
    "榢","槚","檟","毠","泇","浹","犌","猳","玾","筴","糘","嘉","枷","夹","佳","家","加","荚","颊","贾",
    "甲","钾","假","稼","价","架","驾","嫁","耞","脥","腵","莢","蛺","挟","裌","豭","貑","賈","跲","郏",
    "葭","郟","岬","鉀","鉫","鋏","浃","迦","鎵","珈","戛","胛","恝","頬","頰","铗","镓","痂","瘕","駕",
    "袷","蛱","笳","袈","跏","鴶","鵊","麚",":jia"
    ,"侟","俴","倹","偂","傔","儉","冿","剣","剱","劍","劎","劒","劔","囏","堅","堿","墹","姦","姧","寋",
    "帴","幵","弿","彅","徤","惤","戔","戩","挸","揀","揃","揵","撿","擶","攕","旔","栫","梘","検","椾",
    "榗","樫","橌","橏","橺","檢","櫼","殱","殲","洊","涀","減","湕","漸","澗","濺","瀐","瀳","瀸","瀽",
    "熞","熸","牋","猏","珔","瑊","瑐","監","睷","瞯","瞷","瞼","碊","磵","礀","礆","礛","筧","箋","篯",
    "簡","籈","籛","糋","歼","监","坚","尖","笺","间","煎","兼","肩","艰","奸","缄","茧","检","柬","碱",
    "硷","拣","捡","简","俭","剪","减","荐","鉴","践","贱","见","键","箭","件","絸","健","舰","剑","饯",
    "渐","溅","涧","建","緘","縑","繝","繭","纎","臶","艦","艱","菺","葌","葏","葥","蔪","蕑","蕳","薦",
    "藆","虃","螹","蠒","袸","襇","襉","襺","見","覸","詃","諓","諫","謭","譖","譼","譾","賎","賤","僭",
    "趝","谏","谫","踐","廴","菅","蒹","轞","搛","囝","醎","釼","鈃","銒","銭","鋻","湔","蹇","謇","鍳",
    "鍵","鏩","鐗","鐧","缣","鐱","鑑","鑒","鑬","鑯","鑳","钘","枧","閒","間","楗","戋","戬","牮","犍",
    "毽","腱","靬","鞬","韀","韉","睑","锏","餞","餰","鹣","馢","裥","笕","鬋","翦","趼","踺","鰎","鰜",
    "鰹","鲣","鳒","鞯","鳽","鵳","鶼","鹸","鹹","鹻","鹼","麉","黚",":jian"
    ,"勥","匞","塂","壃","夅","奨","奬","將","嵹","弜","弶","彊","摪","摾","杢","槳","橿","櫤","殭","滰",
    "漿","獎","畕","畺","疅","糡","絳","僵","姜","将","浆","江","疆","蒋","桨","奖","讲","匠","酱","降",
    "繮","翞","膙","葁","蔃","蔣","薑","螀","螿","袶","講","謽","茳","醤","醬","洚","绛","缰","犟","韁",
    "礓","顜","耩","糨","豇","鱂","鳉",":jiang"
    ,"儌","劋","勦","呌","嘂","嘄","嘐","嘦","噭","嫶","嬌","嬓","孂","峧","嶕","嶣","恔","憍","憢","挍",
    "摷","撟","撹","攪","敎","敽","敿","斠","晈","暞","曒","櫵","湬","滘","漖","潐","澆","灚","焳","煍",
    "燋","獥","珓","璬","皦","皭","矯","穚","笅","筊","簥","絞","蕉","椒","礁","焦","胶","交","郊","浇",
    "骄","娇","嚼","搅","铰","矫","脚","狡","角","饺","缴","绞","剿","教","酵","轿","较","叫","窖","觉",
    "繳","纐","腳","膠","膲","臫","芁","萩","藠","蟜","蟭","覐","覚","覺","訆","譑","譥","賋","佼","僬",
    "趫","趭","踋","蹻","艽","茭","較","轇","轎","挢","噍","釂","釥","徼","鉸","姣","纟","鐎","敫","餃",
    "皎","鹪","驕","蛟","骹","糸","鮫","醮","跤","鲛","鱎","鵤","鷦","鷮",":jiao"
    ,"丯","倢","偼","傑","刦","刧","刼","劼","卪","唶","喼","堦","堺","媎","媘","媫","嫅","屆","岊","岕",
    "崨","嵥","嶰","嶻","巀","幯","庎","徣","掲","搩","擑","擮","擳","斺","昅","桝","椄","楐","楬","楶",
    "榤","檞","毑","洯","湝","滐","潔","煯","犗","玠","琾","畍","疌","痎","癤","砎","礍","稭","節","結",
    "絜","揭","接","皆","秸","街","阶","截","劫","节","杰","捷","睫","竭","洁","结","解","姐","戒","藉",
    "芥","界","借","介","疥","诫","届","繲","脻","莭","菨","蓵","蛣","蛶","蜐","蝔","蠘","蠞","蠽","衱",
    "衸","袓","袺","褯","觧","詰","誡","誱","謯","讦","诘","踕","迼","拮","喈","嗟","鉣","鍻","婕","孑",
    "桀","階","雃","鞂","碣","頡","飷","疖","颉","蚧","魪","羯","鮚","鲒","骱","鶛",":jie"
    ,"侭","僅","僸","儘","兓","凚","劤","勁","厪","嚍","埐","堻","墐","壗","婜","嫤","嬧","寖","嶜","巹",
    "惍","慬","搢","斳","晉","枃","歏","殣","浕","溍","漌","濅","濜","煡","燼","珒","琎","琻","瑨","璡",
    "璶","盡","砛","祲","笒","紟","巾","筋","斤","金","今","津","襟","紧","锦","仅","谨","进","靳","晋",
    "禁","近","烬","浸","緊","尽","劲","縉","臸","荕","菫","蓳","藎","覲","觔","謹","賮","贐","卺","荩",
    "堇","進","噤","釒","馑","廑","錦","妗","缙","瑾","槿","赆","觐","钅","饉","馸","衿","矜","鹶","黅",
    "齽",":jin"
    ,"亰","仱","傹","儬","凈","剄","坓","坕","坙","妌","婙","婛","宑","巠","幜","弳","徑","憼","擏","旍",
    "暻","曔","桱","梷","橸","汫","汬","浄","涇","淨","瀞","燝","猄","璄","璟","璥","痙","秔","稉","穽",
    "竧","竫","競","竸","経","經","荆","兢","茎","睛","晶","鲸","京","惊","精","粳","经","井","警","景",
    "颈","静","境","敬","镜","径","痉","靖","竟","竞","净","聙","脛","荊","莖","葝","蟼","誩","刭","儆",
    "阱","菁","逕","獍","憬","泾","迳","弪","婧","鏡","陘","肼","胫","腈","靑","靜","旌","頚","頸","驚",
    "鯨","鵛","鶁","麖","麠","鼱",":jing"
    ,"侰","僒","冋","冏","囧","埛","宭","扄","浻","澃","烱","煚","煛","熲","燛","絅","綗","炯","窘","蘏",
    "蘔","褧","逈","銄","迥","扃","顈","颎","駉","駫",":jiong"
    ,"丩","乆","乣","倃","勼","匓","匛","匶","奺","廄","廏","廐","慦","揫","摎","朻","杦","柾","欍","殧",
    "汣","稵","糺","糾","紤","揪","究","纠","玖","韭","久","灸","九","酒","厩","救","旧","臼","舅","咎",
    "就","疚","舊","舏","萛","僦","啾","阄","柩","桕","镹","韮","鸠","鹫","鬮","赳","鬏","鳩","鷲","麔",
    "齨",":jiu"
    ,"乬","伡","侷","俥","倶","冣","凥","劇","勮","匊","啹","坥","埧","埾","壉","姖","娵","婅","婮","屨",
    "岠","崌","巈","巪","弆","忂","怇","怚","愳","懅","懼","拠","挙","挶","捄","揟","據","擧","昛","梮",
    "椇","椈","檋","櫸","欅","歫","毩","毱","泦","洰","涺","淗","湨","澽","焗","焣","爠","犑","狊","珇",
    "痀","眗","砠","秬","筥","簴","籧","粔","粷","桔","鞠","拘","狙","疽","居","驹","菊","局","咀","矩",
    "举","沮","聚","拒","据","巨","具","距","踞","锯","俱","句","惧","炬","剧","罝","耟","聥","腒","臄",
    "舉","艍","葅","蒟","蒩","蓻","蘜","虡","蚷","蜛","螶","襷","詎","諊","豦","倨","趉","趜","跔","讵",
    "跙","踘","蹫","躆","躹","苣","苴","莒","輂","掬","邭","郥","郰","郹","鉅","鋦","鋸","遽","屦","鐻",
    "琚","閰","椐","榘","榉","橘","陱","犋","飓","钜","颶","锔","駏","駒","駶","窭","裾","驧","趄","鮈",
    "鮔","醵","踽","龃","雎","鞫","鴡","鵙","鵴","鶋","鶪","鼰","鼳","齟",":ju"
    ,"劵","勌","勬","呟","圏","埍","埢","奆","姢","帣","弮","惓","慻","捲","朘","梋","棬","淃","獧","瓹",
    "睊","睠","絭","絹","捐","鹃","娟","倦","眷","卷","绢","縳","罥","羂","脧","臇","菤","蔨","蕋","裐",
    "襈","讂","踡","鄄","狷","鋑","鋗","錈","涓","鎸","鐫","桊","鞙","韏","蠲","锩","镌","餋","鵑",":juan"
    ,"亅","傕","刔","勪","匷","吷","啳","孒","屩","屫","嶥","弡","彏","憠","憰","戄","挗","捔","撧","斍",
    "橜","欔","欮","殌","氒","決","泬","潏","灍","焆","熦","爑","爴","玃","玦","玨","瑴","璚","疦","瘚",
    "矡","砄","穱","絕","絶","撅","攫","抉","掘","倔","爵","决","诀","绝","繑","芵","蕝","虳","蚗","蟨",
    "蟩","觼","訣","誳","譎","貜","厥","劂","谲","矍","蹷","躩","蕨","逫","噘","崛","鈌","獗","孓","鐝",
    "珏","钁","桷","镼","橛","爝","镢","蹶","觖","鶌","鷢","龣",":jue"
    ,"儁","呁","埈","姰","寯","懏","晙","桾","汮","焌","燇","珺","畯","皸","皹","碅","箘","箟","均","菌",
    "钧","军","君","峻","俊","竣","郡","骏","莙","葰","蚐","蜠","袀","覠","軍","捃","鈞","銁","銞","鍕",
    "陖","雋","餕","馂","皲","駿","筠","鮶","隽","鲪","麇","鵔","鵕","鵘","麏","麕",":jun"
    ,"呿","哢","垰","喀","咖","卡","衉","裃","佧","咔","鉲","胩",":ka"
    ,"凱","勓","喫","噄","塏","奒","愒","愷","愾","暟","欯","炌","烗","开","揩","楷","凯","慨","剀","垲",
    "輆","蒈","忾","恺","鍇","鎎","鎧","鐦","開","闓","闿","铠","颽","锎","锴",":kai"
    ,"偘","冚","埳","塪","墈","崁","嵁","惂","栞","檻","欿","矙","磡","竷","槛","刊","堪","勘","坎","砍",
    "看","衎","侃","輡","輱","莰","轗","阚","闞","戡","龛","瞰","龕",":kan"
    ,"匟","囥","嫝","嵻","忼","摃","槺","漮","砊","穅","粇","康","慷","糠","扛","抗","亢","炕","伉","躿",
    "邟","鈧","闶","鏮","閌","钪","鱇",":kang"
    ,"嵪","攷","洘","焅","考","拷","烤","靠","薧","訄","銬","尻","栲","犒","铐","髛","鮳","鯌","鲓",":kao"
    ,"剋","勀","勊","堁","娔","尅","嵑","嵙","嶱","悈","愙","揢","敤","榼","樖","歁","殼","毼","渇","炣",
    "牁","犐","痾","硞","碦","磆","礊","礚","穒","窼","簻","緙","坷","苛","柯","棵","磕","颗","科","壳",
    "咳","可","渴","克","刻","客","课","翗","胢","艐","萪","薖","袔","課","趷","軻","嗑","醘","岢","鈳",
    "恪","溘","屙","骒","缂","珂","轲","氪","頦","顆","瞌","钶","锞","稞","疴","窠","騍","颏","蚵","蝌",
    "髁",":ke"
    ,"墾","懇","掯","硍","肯","啃","垦","恳","肎","肻","褃","豤","貇","錹","頎","裉",":ken"
    ,"劥","坈","妔","挳","揁","摼","殸","牼","硁","硜","硻","坑","吭","誙","踁","銵","鍞","鏗","铿",":keng"
    ,"埪","宆","悾","椌","硿","空","恐","孔","控","羫","倥","躻","崆","錓","鞚","箜","鵼",":kong"
    ,"冦","剾","劶","宼","彄","怐","摳","敂","滱","瞉","瞘","窛","竘","簆","抠","口","扣","寇","蔲","芤",
    "蔻","叩","釦","眍","筘","鷇",":kou"
    ,"俈","嚳","圐","崫","庫","廤","捁","搰","桍","楛","泏","狜","瘔","矻","秙","窋","絝","枯","哭","窟",
    "苦","酷","库","裤","袴","褲","刳","跍","堀","郀","喾","绔","鮬","骷","齁",":ku"
    ,"咵","姱","恗","晇","夸","垮","挎","跨","胯","舿","誇","侉","銙","顝","骻",":kua"
    ,"儈","凷","噲","圦","塊","巜","廥","擓","旝","獪","璯","糩","块","筷","侩","快","膾","蕢","蒯","郐",
    "哙","鄶","狯","脍","駃","鱠","鲙",":kuai"
    ,"寛","寬","梡","欵","歀","窽","窾","宽","款","鑧","髖","髋",":kuan"
    ,"儣","劻","匩","壙","岲","恇","懬","懭","昿","曠","況","洭","爌","狅","眖","砿","礦","穬","筺","絋",
    "絖","匡","筐","狂","框","矿","眶","旷","况","纊","誆","誑","貺","诓","诳","邝","圹","軖","軠","軦",
    "軭","夼","邼","哐","鄺","鉱","鋛","纩","鑛","贶","鵟","黋",":kuang"
    ,"刲","匱","卼","嘳","媿","嬇","尯","巋","憒","戣","晆","楏","楑","樻","櫆","欳","殨","潰","煃","窺",
    "簣","籄","亏","盔","岿","窥","葵","奎","魁","馈","愧","溃","聧","聭","聵","藈","蘬","蘷","虁","虧",
    "馗","匮","夔","蹞","躨","蒉","揆","鄈","喹","喟","悝","愦","鍨","逵","鍷","鐀","鑎","闚","暌","頄",
    "頍","頯","睽","餽","饋","聩","騤","蝰","骙","篑","跬",":kui"
    ,"堃","堒","壸","壼","婫","尡","崐","崑","晜","涃","潉","焜","熴","猑","瑻","睏","硱","祵","稇","稛",
    "綑","坤","昆","捆","困","臗","菎","蜫","裈","裍","裩","褌","悃","阃","錕","琨","閫","閸","锟","騉",
    "髠","髨","醌","鯤","鲲","髡","鵾","鶤","鹍",":kun"
    ,"懖","拡","擴","桰","漷","濶","秳","筈","括","扩","廓","阔","萿","葀","闊","霩","鞟","鞹","韕","頢",
    "蛞","鬠",":kuo"
    ,"儠","嚹","揦","揧","搚","擸","攋","柆","楋","櫴","溂","爉","瓎","磖","垃","拉","喇","蜡","腊","辣",
    "啦","翋","臈","臘","菈","藞","蝋","蝲","蠟","剌","辢","邋","鑞","镴","旯","鞡","砬","瘌","鬎","鯻",
    "鱲",":la"
    ,"來","俫","倈","勑","唻","婡","崍","庲","徠","梾","棶","淶","瀨","瀬","猍","琜","癩","睞","筙","箂",
    "籟","莱","来","赖","萊","藾","襰","誺","賚","賴","逨","郲","崃","徕","涞","濑","錸","赉","睐","頼",
    "顂","铼","癞","騋","籁","鯠","鵣","鶆","麳",":lai"
    ,"儖","厱","嚂","囒","壈","壏","嬾","孄","孏","嵐","幱","惏","懢","懶","擥","攔","攬","斕","暕","欄",
    "欖","欗","浨","湅","濫","瀾","灆","灠","灡","煉","燗","燣","爁","爛","爤","爦","璼","瓓","礷","籃",
    "籣","糷","繿","纜","蓝","婪","栏","拦","篮","阑","兰","澜","谰","揽","览","懒","缆","烂","滥","葻",
    "藍","蘫","蘭","襕","襤","襴","襽","覧","覽","譋","讕","躝","醂","岚","漤","鑭","钄","榄","闌","斓",
    "韊","罱","顲","镧","褴",":lan"
    ,"俍","勆","哴","唥","埌","塱","嫏","悢","朖","朤","桹","樃","欴","烺","瑯","硠","筤","琅","榔","狼",
    "廊","郎","朗","浪","羮","脼","艆","蓈","蓢","蜋","誏","躴","莨","蒗","郒","郞","啷","阆","鋃","鎯",
    "閬","锒","稂","螂",":lang"
    ,"僗","労","勞","咾","哰","嗠","嘮","嫪","嶗","恅","憥","憦","撈","朥","橑","橯","浶","澇","珯","癆",
    "硓","磱","窂","簩","粩","捞","劳","牢","老","佬","姥","酪","烙","涝","耂","耮","荖","蛯","蟧","軂",
    "轑","唠","崂","銠","鐒","栳","顟","铑","铹","痨","耢","髝","鮱","醪",":lao"
    ,"忇","扐","楽","樂","氻","牞","玏","砳","竻","簕","勒","乐","了","艻","仂","叻","泐","阞","韷","餎",
    "饹","鰳","鳓",":le"
    ,"傫","儽","厽","塁","壘","壨","攂","樏","櫐","櫑","欙","洡","涙","淚","灅","瓃","畾","瘣","癗","矋",
    "磥","礌","礧","礨","祱","禷","絫","縲","纇","纍","纝","罍","雷","镭","蕾","磊","累","儡","垒","擂",
    "肋","类","泪","腂","蔂","蕌","藟","蘱","蘲","蘽","虆","蠝","誄","讄","羸","诔","轠","嘞","銇","錑",
    "嫘","缧","鐳","鑘","鑸","檑","靁","頛","頪","類","颣","耒","酹","鱩","鸓","鼺",":lei"
    ,"倰","堎","睖","碐","稜","棱","楞","冷","薐","踜","塄","輘","愣",":leng"
    ,"儮","儷","凓","刕","剓","剺","劙","勵","厤","厯","厲","叓","唎","嚟","嚦","囄","囇","塛","壢","娳",
    "婯","孋","孷","屴","岦","峛","峲","巁","廲","悡","悧","悷","慄","搮","攊","攦","攭","暦","曆","曞",
    "朸","栃","栛","栵","梸","棃","棙","樆","檪","櫔","櫟","櫪","欐","欚","歴","歷","氂","沴","浬","涖",
    "濿","瀝","灕","爄","爏","犂","犛","犡","珕","琍","瑮","瓅","瓈","瓑","瓥","癘","癧","皪","盠","盭",
    "睝","矖","砅","磿","礪","礫","礰","禮","禲","秝","穲","竰","筣","籬","粚","粴","糎","糲","綟","縭",
    "纚","厘","梨","犁","黎","篱","狸","离","漓","理","李","里","鲤","礼","莉","荔","吏","栗","丽","厉",
    "励","砾","历","利","傈","例","俐","痢","立","粒","沥","隶","力","璃","哩","脷","艃","苙","茘","荲",
    "菞","蒚","蒞","蔾","藶","蘺","蚸","蛠","蜧","蝷","蟍","蟸","蠇","蠣","蠫","裏","裡","褵","觻","謧",
    "讈","俪","俚","赲","郦","坜","苈","莅","蓠","轢","轣","藜","邌","邐","呖","唳","喱","酈","醨","釐",
    "猁","鉝","銐","鋫","鋰","錅","溧","澧","逦","娌","嫠","骊","鏫","缡","鑗","枥","栎","轹","隷","隸",
    "離","靂","靋","戾","砺","詈","罹","锂","鹂","疠","疬","蛎","蜊","驪","鬁","蠡","笠","篥","粝","鯉",
    "鯏","醴","鯬","雳","鲡","鱧","鱱","鱳","鱺","鳢","黧","鳨","鴗","鵹","鷅","鸝","麗","麜",":li"
    ,"亷","僆","劆","匲","匳","嗹","噒","堜","奩","媡","嫾","嬚","孌","慩","憐","戀","摙","攣","斂","梿",
    "槤","櫣","歛","殮","浰","溓","漣","澰","濓","瀲","熑","燫","瑓","璉","磏","稴","簾","籢","籨","練",
    "縺","纞","羷","联","莲","连","镰","廉","怜","涟","帘","敛","脸","链","恋","炼","练","翴","聨","聫",
    "聮","聯","臉","萰","蓮","薕","薟","蘝","蘞","螊","褳","襝","覝","謰","譧","蹥","蔹","奁","連","鄻",
    "潋","錬","鍊","濂","鎌","鏈","鐮","琏","楝","殓","臁","裢","裣","蠊","鬑","鰊","鰱","鲢",":lian"
    ,"両","倆","倞","兩","唡","啢","喨","掚","樑","涼","湸","煷","簗","糧","綡","緉","俩","粮","凉","梁",
    "粱","良","两","辆","量","晾","亮","谅","蜽","裲","諒","冫","墚","輌","輛","輬","辌","鍄","椋","靚",
    "駺","魎","踉","靓","魉",":liang"
    ,"僇","嫽","尞","屪","嵺","嶚","嶛","廫","憀","憭","敹","暸","樛","漻","炓","爎","爒","璙","療","瞭",
    "窷","竂","簝","繚","撩","聊","僚","疗","燎","寥","辽","潦","撂","镣","廖","料","膋","膫","蟉","蟟",
    "豂","賿","蹘","蹽","蓼","尥","遼","鄝","嘹","釕","獠","寮","鏐","鐐","缭","镠","镽","钌","飉","鹩",
    "髎","鷯",":liao"
    ,"劦","劽","哷","埓","奊","姴","峢","巤","忚","挒","挘","毟","浖","烮","煭","犣","猟","獵","睙","列",
    "裂","烈","劣","猎","聗","脟","茢","蛚","冽","埒","迾","捩","咧","洌","颲","鬛","趔","鮤","躐","鬣",
    "鴷",":lie"
    ,"亃","伈","僯","凜","壣","崊","廩","恡","悋","懍","撛","斴","晽","暽","橉","檁","涁","潾","澟","瀶",
    "焛","燐","獜","璘","甐","疄","痳","碄","箖","粦","繗","琳","林","磷","霖","临","邻","鳞","淋","凛",
    "赁","吝","拎","翷","臨","菻","藺","賃","蹸","躙","躪","蔺","轔","轥","啉","鄰","嶙","廪","懔","遴",
    "鏻","閵","檩","辚","隣","膦","瞵","驎","粼","魿","躏","鱗","麟","麐",":lin"
    ,"刢","坽","夌","姈","婈","孁","岺","崚","嶺","彾","掕","昤","朎","櫺","欞","淩","澪","瀮","炩","燯",
    "爧","狑","琌","皊","砱","祾","秢","竛","笭","紷","綾","玲","菱","零","龄","铃","伶","羚","凌","灵",
    "陵","岭","领","另","令","舲","蓤","蔆","蕶","蘦","衑","袊","裬","詅","跉","酃","苓","軨","呤","囹",
    "醽","鈴","泠","錂","绫","柃","棂","閝","阾","瓴","霊","霗","霛","霝","靇","靈","領","駖","聆","蛉",
    "翎","鯪","鲮","鴒","鸰","鹷","麢","齡","齢","龗",":ling"
    ,"劉","嚠","塯","媹","嬼","嵧","廇","懰","旈","栁","桞","桺","橊","橮","沠","澑","瀏","熮","珋","瑠",
    "瑬","璢","畂","畄","畱","疁","癅","磂","磟","綹","罶","羀","翏","溜","琉","榴","硫","馏","留","刘",
    "瘤","流","柳","六","蒥","蓅","藰","裗","蹓","鋶","浏","遛","鎦","骝","鐂","绺","雡","霤","旒","熘",
    "飀","飂","飅","飗","锍","镏","餾","鹨","駠","駵","騮","驑","鬸","鰡","鎏","鶹","鷚","鹠","麍",":liu"
    ,"囖",":lo"
    ,"儱","嚨","壟","壠","屸","嶐","巃","巄","徿","攏","昽","曨","朧","梇","槞","櫳","湰","滝","漋","瀧",
    "爖","瓏","眬","矓","礱","礲","竉","篭","籠","龙","聋","咙","笼","窿","隆","垄","拢","陇","聾","蕯",
    "蘢","蠪","蠬","衖","襱","谾","豅","贚","垅","躘","茏","泷","鏧","珑","鑨","栊","隴","胧","霳","砻",
    "癃","驡","鸗","龍","龓",":long"
    ,"嘍","塿","婁","屚","嶁","廔","慺","摟","樓","溇","漊","熡","甊","瘺","窶","簍","耬","楼","娄","搂",
    "篓","漏","陋","膢","艛","蔞","螻","謱","軁","蒌","遱","喽","嵝","鏤","鞻","镂","瘘","耧","蝼","髏",
    "髅",":lou"
    ,"侓","剹","勎","勠","嚕","嚧","圥","坴","塶","塷","壚","娽","峍","廘","廬","彔","挔","捛","摝","擄",
    "擼","攄","攎","枦","椂","樐","櫓","櫨","氌","淕","淥","滷","澛","瀂","瀘","爐","獹","玈","琭","瓐",
    "甪","盝","盧","睩","矑","硉","硵","磠","祿","稑","穋","箓","簬","簵","簶","籙","籚","粶","緑","纑",
    "罏","芦","卢","颅","庐","炉","掳","卤","虏","鲁","麓","碌","露","路","赂","鹿","潞","禄","录","陆",
    "戮","膟","臚","舮","艣","艪","艫","菉","蓾","蔍","蕗","蘆","虂","虜","螰","蠦","觮","賂","趢","踛",
    "蹗","垆","輅","轆","轤","撸","噜","醁","鈩","泸","錄","渌","漉","録","錴","逯","鏀","鏴","鐪","鑥",
    "鑪","璐","栌","橹","轳","辂","陸","辘","氇","胪","顱","镥","鸬","鹭","騄","騼","髗","簏","魯","魲",
    "舻","鯥","鲈","鱸","鴼","鵦","鵱","鷺","鸕","鹵","黸",":lu"
    ,"乿","亂","圝","圞","奱","孿","巒","曫","欒","灓","灤","癴","癵","羉","峦","挛","孪","滦","卵","乱",
    "臠","虊","脔","釠","娈","鑾","栾","鸾","銮","鵉","鸞",":luan"
    ,"剠","圙","擽","畧","稤","掠","略","鋝","鋢","锊",":lue"
    ,"侖","倫","圇","埨","婨","崘","崙","惀","掄","棆","淪","溣","碖","磮","稐","綸","耣","抡","轮","伦",
    "仑","沦","纶","论","腀","菕","蜦","論","踚","輪","囵","陯","鯩",":lun"
    ,"儸","剆","啰","囉","峈","挼","攞","曪","欏","洜","濼","犖","癳","砢","硦","笿","籮","絡","纙","羅",
    "萝","螺","罗","逻","锣","箩","骡","裸","落","洛","骆","络","腡","臝","茖","蓏","蘿","蛒","覶","覼",
    "倮","蠃","躶","荦","摞","邏","猡","泺","漯","鏍","珞","鑼","椤","脶","頱","镙","饠","駱","瘰","騾",
    "驘","鮥","跞","雒","鵅","鸁",":luo"
    ,"侶","僂","儢","勴","卛","呂","垏","寠","寽","屢","嵂","慮","曥","梠","櫖","櫚","氀","濾","焒","爈",
    "瘻","瞜","祣","穞","穭","箻","絽","綠","縷","繂","驴","吕","铝","侣","旅","履","屡","缕","虑","氯",
    "律","率","滤","绿","膐","葎","藘","褸","偻","捋","郘","闾","鋁","鑢","閭","榈","膂","稆","馿","褛",
    "驢","鷜",":lv"
    ,"亇","傌","嗎","嘜","媽","嫲","孖","尛","榪","溤","犘","獁","瑪","痲","睰","碼","礣","祃","禡","罵",
    "妈","麻","玛","码","蚂","马","骂","嘛","吗","蔴","螞","蟇","遤","犸","鎷","杩","閁","馬","駡","蟆",
    "鬕","鰢","鷌",":ma"
    ,"佅","勱","嘪","売","埋","买","麦","卖","迈","脈","蕒","衇","貍","買","賣","劢","荬","邁","唛","霡",
    "霢","霾","鷶","麥",":mai"
    ,"僈","姏","屘","悗","慲","摱","槾","樠","満","滿","澷","獌","睌","瞞","矕","縵","瞒","馒","蛮","满",
    "蔓","曼","慢","漫","谩","蔄","蘰","蟃","蟎","蠻","襔","謾","墁","幔","鏋","鏝","缦","熳","顢","镘",
    "饅","颟","螨","鬗","鬘","鰻","鳗","鞔",":man"
    ,"厖","吂","哤","壾","娏","尨","庬","恾","朚","杗","杧","汒","浝","牤","牻","狵","甿","痝","笀","芒",
    "茫","盲","氓","忙","莽","茻","莾","蘉","蠎","邙","釯","鋩","漭","铓","硭","駹","蟒","鸏","鹲","龒",":mang"
    ,"乮","冃","冇","冐","堥","媢","愗","戼","暓","枆","楙","毣","毷","渵","獏","皃","秏","笷","緢","罞",
    "猫","茅","锚","毛","矛","铆","卯","茂","冒","帽","貌","贸","芼","萺","蓩","蝐","覒","貓","貿","袤",
    "軞","茆","鄚","鄮","酕","峁","鉚","鉾","泖","錨","瑁","昴","牦","耄","霿","旄","懋","瞀","髳","蟊",
    "髦","鶜",":mao"
    ,"嚒","嚜","嚰","孭","庅","濹","么","麽","麼",":me"
    ,"凂","坆","堳","塺","媄","媺","嬍","嵄","徾","抺","挴","攗","攟","旀","栂","楳","槑","櫗","毎","氼",
    "沒","沬","渼","湈","煝","燘","珻","瑂","痗","眊","眛","睂","睸","矀","祙","禖","篃","羙","脄","脢",
    "玫","枚","梅","酶","霉","煤","没","眉","媒","镁","每","美","昧","寐","妹","媚","腜","苺","葿","蘪",
    "蝞","跊","躾","莓","郿","嵋","猸","鋂","浼","湄","鎂","鎇","楣","镅","鹛","袂","鬽","魅","鶥","黣",
    "黴",":mei"
    ,"們","怋","悶","懣","捫","暪","椚","殙","燜","玣","璊","穈","门","闷","们","菛","虋","扪","鍆","門",
    "閅","焖","懑","钔",":men"
    ,"儚","冡","夢","夣","幪","懜","懞","掹","擝","曚","橗","氋","溕","濛","獴","瓾","矇","矒","萌","蒙",
    "檬","盟","锰","猛","梦","孟","莔","萠","蕄","蝱","勐","甍","瞢","鄳","鄸","懵","錳","朦","霥","靀",
    "礞","顭","饛","虻","蜢","蠓","艋","艨","鯍","鯭","黽","鼆",":meng"
    ,"踎",":meo"
    ,"侎","冞","冪","哋","塓","孊","宻","峚","幎","幦","彌","擟","榓","樒","檷","櫁","沕","沵","洣","淧",
    "渳","滵","漞","濗","瀰","灖","熐","爢","獼","瓕","瞇","禰","簚","籋","粎","罙","羃","羋","眯","醚",
    "靡","糜","迷","谜","弥","米","秘","觅","泌","蜜","密","幂","葞","蒾","蓂","蔝","蔤","藌","蝆","袮",
    "覓","覔","覛","詸","謎","謐","芈","谧","蘼","咪","嘧","醾","醿","釄","猕","銤","汨","宓","弭","鑖",
    "镾","脒","祢","敉","縻","麋","鸍","麊","麛","鼏",":mi"
    ,"丏","俛","偭","勔","厸","喕","婂","媔","嬵","愐","檰","櫋","汅","澠","矈","矊","矏","糆","綿","緜",
    "緬","棉","眠","绵","冕","免","勉","娩","缅","面","芇","葂","蝒","蠠","沔","渑","湎","腼","靣","靦",
    "眄","鮸","黾","麪","麫","麵","麺",":mian"
    ,"仯","媌","嫹","庿","廟","竗","篎","緲","苗","描","瞄","藐","秒","渺","庙","妙","訬","喵","邈","缈",
    "杪","淼","眇","鹋","鱙","鶓",":miao"
    ,"吀","哶","幭","懱","搣","滅","蔑","灭","薎","衊","咩","蠛","篾","鱴",":mie"
    ,"僶","冧","冺","刡","勄","垊","姄","崏","慜","憫","捪","敃","敯","旻","旼","暋","湏","湣","潣","琘",
    "琝","瑉","痻","盿","碈","笢","笽","簢","緍","緡","罠","民","抿","皿","敏","悯","闽","賯","苠","岷",
    "鈱","闵","泯","錉","鍲","缗","玟","珉","閔","閩","愍","鰵","鳘",":min"
    ,"佲","凕","姳","嫇","慏","掵","朙","榠","洺","猽","眀","眳","明","螟","鸣","铭","名","命","覭","詺",
    "冥","茗","鄍","銘","溟","暝","瞑","酩","鳴",":ming"
    ,"繆","谬","謬","缪",":miu"
    ,"劘","劰","嗼","嚤","嚩","圽","塻","妺","嫼","嬤","帞","怽","懡","戂","擵","攠","昩","暯","枺","橅",
    "歿","瀎","爅","狢","皌","眜","眽","眿","瞐","瞙","砞","礳","貉","粖","糢","絈","縸","纆","脉","摸",
    "摹","蘑","模","膜","磨","摩","魔","抹","末","莫","墨","默","沫","漠","寞","陌","艒","莈","藦","蛨",
    "蟔","謨","謩","貃","貈","谟","茉","蓦","馍","銆","鏌","嫫","嬷","殁","镆","秣","饃","饝","瘼","耱",
    "驀","髍","魩","魹","貊","貘","麿","黙",":mo"
    ,"劺","呣","恈","洠","谋","牟","某","謀","侔","哞","鞪","眸","蛑","蝥","鍪","鴾","麰",":mou"
    ,"凩","嘸","峔","幙","慔","朷","楘","樢","氁","炑","牳","狇","畆","畒","畝","畞","畮","砪","胟","拇",
    "牡","亩","姆","母","墓","暮","幕","募","慕","木","目","睦","牧","穆","莯","蚞","仫","踇","坶","苜",
    "呒","鉧","鉬","沐","雮","霂","毪","钼",":mu"
    ,"乸","內","吶","嗱","妠","拏","挐","秅","笝","篛","納","拿","哪","呐","钠","那","娜","纳","蒘","蒳",
    "袦","訤","詉","誽","豽","軜","捺","郍","鈉","鎿","雫","肭","靹","镎","衲","魶",":na"
    ,"倷","妳","孻","廼","搱","摨","渿","熋","疓","腉","氖","乃","奶","耐","奈","螚","褦","鼐","艿","萘",
    "迺","釢","錼","柰",":nai"
    ,"侽","娚","婻","嫨","戁","抩","揇","暔","枏","枬","柟","湳","煵","畘","南","男","难","莮","萳","諵",
    "遖","喃","囡","楠","難","腩","蝻","赧",":nan"
    ,"乪","儾","嚢","崀","搑","擃","欜","涳","瀼","灢","囊","蠰","攮","囔","馕","曩","饢","鬞","齉",":nang"
    ,"匘","堖","夒","婥","嫐","峱","嶩","巎","巙","怓","悩","惱","憹","撓","檂","獶","獿","碙","碯","脳",
    "腦","臑","挠","脑","恼","闹","淖","蝚","蟯","譊","孬","垴","呶","猱","鐃","瑙","閙","硇","铙","蛲",
    "鬧",":nao"
    ,"抐","眲","呢","訥","讷",":ne"
    ,"娞","氝","浽","腇","馁","内","餒","鮾","鯘",":nei"
    ,"媆","嫰","嫩",":nen"
    ,"竜","能",":neng"
    ,"伱","儞","埿","堄","婗","嫟","嬺","孨","孴","屔","惄","愵","抳","擬","晲","暱","柅","棿","淣","濔",
    "灄","狔","痆","眤","秜","籾","縌","聻","胒","腝","膩","妮","霓","倪","泥","尼","拟","你","匿","腻",
    "逆","溺","臡","苨","薿","蚭","蛪","蜺","觬","貎","伲","跜","坭","迡","郳","鈮","猊","怩","鉨","鑈",
    "昵","隬","旎","睨","铌","馜","鯢","鲵","麑","齯",":ni"
    ,"卄","哖","姩","撚","攆","涊","淰","焾","秊","秥","簐","蔫","拈","年","碾","撵","捻","念","艌","辗",
    "廿","跈","蹨","埝","躎","輦","輾","辇","黏","鮎","鯰","鲇","鲶","鵇",":nian"
    ,"嬢","娘","酿","醸","釀",":niang"
    ,"嫋","嬝","尦","鸟","尿","茮","蔦","裊","褭","茑","嬲","脲","袅","鳥",":niao"
    ,"喦","嚙","囁","囐","囓","圼","孼","嵲","嶭","巕","帇","惗","揑","摰","敜","枿","槷","櫱","篞","糱",
    "糵","聶","捏","聂","孽","啮","镊","镍","涅","臲","苶","菍","蠥","諗","讘","乜","陧","踂","踗","踙",
    "躡","蘖","嗫","銸","鋷","錜","鎳","鑷","闑","隉","顳","颞","臬","蹑","齧",":nie"
    ,"囜","拰","脌","您","恁",":nin"
    ,"侫","儜","嚀","嬣","寍","寕","寗","寜","寧","擰","橣","檸","澝","濘","獰","矃","聹","柠","狞","凝",
    "宁","拧","泞","薴","佞","咛","甯","鑏","聍","鬡","鬤","鸋",":ning"
    ,"杻","沑","炄","牜","紐","牛","扭","钮","纽","莥","拗","狃","鈕","忸","妞","靵",":niu"
    ,"儂","噥","挊","挵","欁","濃","癑","禯","秾","穠","繷","膿","脓","浓","农","弄","莀","蕽","襛","侬",
    "農","辳","廾","哝","醲","齈",":nong"
    ,"啂","嬬","槈","檽","獳","羺","譨","譳","鎒","鐞","耨",":nou"
    ,"伮","傉","搙","砮","笯","奴","努","怒","弩","胬","孥","驽","駑",":nu"
    ,"奻","渜","煗","暖","餪",":nuan"
    ,"瘧","硸","虐","疟",":nue"
    ,"黁",":nun"
    ,"儺","堧","愞","懧","掿","搻","梛","榒","橠","稬","穤","糑","糥","耎","挪","懦","糯","诺","袲","諾",
    "傩","蹃","搦","逽","喏","锘",":nuo"
    ,"朒","籹","女","衂","釹","恧","钕","衄",":nv"
    ,"筽","哦","噢",":o"
    ,"吘","吽","嘔","塸","慪","敺","櫙","歐","毆","漚","澫","熰","甌","腢","膒","欧","鸥","殴","藕","呕",
    "偶","沤","蓲","蕅","藲","謳","讴","醧","怄","鏂","瓯","耦","鴎","鷗","齵",":ou"
    ,"妑","帊","掱","潖","耙","舥","啪","趴","爬","帕","怕","琶","袙","跁","葩","杷","筢",":pa"
    ,"犤","猅","簰","拍","排","牌","徘","湃","派","俳","輫","蒎","哌","鎃",":pai"
    ,"冸","坢","媻","宷","幋","柈","槃","沜","洀","溿","瀊","炍","牉","畨","盤","盻","眅","眫","縏","膰",
    "攀","潘","盘","磐","盼","畔","判","叛","蒰","詊","踫","蹣","爿","泮","鋬","鎜","鑻","闆","鞶","頖",
    "袢","襻","蟠","蹒","鵥",":pan"
    ,"厐","夆","汸","沗","炐","磅","篣","肨","胮","膖","舽","乓","庞","旁","耪","胖","蠭","覫","趽","彷",
    "滂","逄","雱","霶","髈","螃","鰟","鳑","龎","龐",":pang"
    ,"垉","奅","拋","炰","爮","犥","皰","砲","礟","礮","窌","抛","咆","刨","炮","袍","跑","泡","萢","褜",
    "軳","匏","狍","庖","脬","鞄","颮","疱","麅","麭",":pao"
    ,"伂","俖","妚","姵","婄","嶏","怌","抷","攈","斾","毰","浿","珮","笩","肧","呸","胚","培","裴","赔",
    "陪","配","佩","沛","茷","蓜","衃","裵","賠","轡","辔","帔","錇","阫","陫","旆","锫","馷","駍","醅",
    "霈",":pei"
    ,"呠","噴","歕","濆","瓫","翸","喷","盆","葐","衯","湓",":pen"
    ,"倗","剻","匉","塜","塳","弸","恲","憉","掽","摓","梈","椖","椪","槰","樥","泙","淎","淜","漨","漰",
    "熢","皏","硑","磞","稝","竼","纄","胓","砰","抨","烹","澎","彭","蓬","棚","硼","篷","膨","朋","鹏",
    "捧","碰","芃","荓","莑","蟚","堋","軯","軿","輣","輧","嘭","怦","鑝","閛","韸","韼","髼","鬅","蟛",
    "鬔","鵬",":peng"
    ,"伓","伾","噽","嚊","嚭","壀","嫓","岯","憵","揊","朇","榌","毘","毞","渒","潎","澼","炋","焷","狉",
    "狓","猈","疈","辟","睤","磇","礔","礕","秛","秠","篺","簲","紕","羆","耚","脴","腗","膍","坯","砒",
    "霹","批","披","劈","琵","毗","苉","啤","脾","疲","皮","匹","痞","僻","屁","譬","蚽","螷","蠯","豼",
    "豾","丕","仳","陴","邳","郫","圮","埤","鼙","芘","擗","噼","釽","鈲","鈹","庀","鉟","銔","銢","錃",
    "淠","媲","纰","枇","闢","阰","甓","隦","顖","睥","罴","铍","駓","癖","蚍","蜱","髬","魾","鮍","貔",
    "鲏","鴄","鵧","鷿",":pi"
    ,"囨","媥","徧","楄","楩","腁","篇","偏","片","骗","覑","諚","諞","貵","賆","谝","骈","犏","胼","駢",
    "騈","騗","騙","骿","魸","翩","蹁",":pian"
    ,"勡","彯","慓","旚","皫","磦","縹","翲","飘","漂","瓢","票","薸","剽","莩","嘌","醥","嫖","缥","殍",
    "闝","顠","瞟","飃","飄","螵","魒",":piao"
    ,"嫳","撆","暼","撇","瞥","覕","丿","苤","鐅","氕",":pie"
    ,"嚬","嬪","朩","汖","玭","矉","礗","穦","拼","频","贫","品","聘","薲","蘋","貧","拚","姘","嫔","榀",
    "牝","頻","顰","馪","颦","驞",":pin"
    ,"凴","呯","塀","娦","屛","岼","帡","帲","幈","慿","憑","洴","涄","焩","玶","甁","甹","砯","竮","箳",
    "簈","缾","聠","艵","乒","坪","苹","萍","平","凭","瓶","评","屏","蓱","蚲","蛢","評","俜","冖","郱",
    "娉","枰","頩","鮃","鲆",":ping"
    ,"嘙","奤","尀","屰","岥","岶","巿","廹","敀","昢","櫇","洦","溌","潑","烞","皛","砶","坡","泼","颇",
    "婆","破","魄","迫","粕","蒪","謈","叵","鄱","酦","醱","釙","鉕","鏺","珀","攴","頗","钋","钷","皤",
    "駊","笸",":po"
    ,"咅","哣","抔","抙","捊","犃","剖","裒","掊","頮","颒",":pou"
    ,"僕","圑","圤","墣","巬","巭","撲","暜","樸","檏","潽","炇","烳","痡","瞨","穙","脯","纀","舖","舗",
    "扑","铺","仆","莆","葡","菩","蒲","埔","朴","圃","普","浦","谱","曝","菐","蒱","蜅","襆","襥","諩",
    "譜","贌","匍","噗","酺","鋪","溥","濮","鏷","鐠","璞","氆","镤","镨","駇","蹼",":pu"
    ,"亝","倛","傶","僛","剘","呇","呮","咠","唘","唭","啓","啔","啟","噐","埼","夡","娸","婍","岓","嵜",
    "忯","恓","悽","愭","慼","慽","憇","扺","捿","掑","摖","斉","斊","旂","暣","朞","栔","桼","梩","棄",
    "棊","棨","棲","榿","檱","櫀","欫","気","氣","洓","淒","渏","湆","湇","濝","炁","猉","玂","玘","甈",
    "疧","盀","盵","碁","碕","碶","磎","磜","磧","磩","祇","禥","竒","簯","簱","籏","粸","紪","綥","綨",
    "綺","緀","緕","纃","缼","罊","肵","臍","艩","芞","期","欺","栖","戚","妻","七","凄","漆","柒","沏",
    "其","棋","奇","歧","畦","崎","脐","齐","旗","祈","祁","骑","起","岂","乞","企","启","契","砌","器",
    "气","迄","弃","汽","泣","讫","荎","薺","藄","蘄","蚑","蚔","蚚","蜝","螇","螧","蠐","袳","褄","訖",
    "諆","諬","諿","豈","亓","趞","跂","圻","軙","軝","芑","芪","荠","萁","萋","葺","迉","蕲","邔","郪",
    "嘁","屺","岐","釮","汔","淇","骐","鏚","绮","琪","琦","杞","桤","槭","闙","耆","霋","祺","憩","碛",
    "饑","颀","騎","騏","騹","蛴","蜞","鬐","鬿","魌","魕","綦","綮","鯕","蹊","鰭","鲯","鳍","麒","鵸",
    "鶀","鶈","麡","鼜","齊",":qi"
    ,"冾","圶","帢","愘","拤","搳","殎","硈","磍","掐","恰","洽","跒","葜","酠","鞐","髂",":qia"
    ,"伣","俔","僉","儙","刋","嗛","圱","圲","塹","墘","壍","奷","媊","嬱","孅","岒","嵰","廞","忴","悓",
    "慳","扡","扲","拑","拪","撁","攐","攑","攓","朁","杄","杴","棈","榩","槏","槧","橬","檶","櫏","歬",
    "汘","汧","淺","潛","濳","灊","煔","燂","牽","皘","竏","箞","篏","篟","簽","籖","籤","粁","綪","縴",
    "繾","羬","膁","臤","茾","牵","扦","钎","铅","千","迁","签","仟","谦","乾","黔","钱","钳","前","潜",
    "遣","浅","谴","堑","嵌","欠","歉","葴","蒨","蔳","藖","蚈","蚙","蜸","諐","謙","譴","谸","倩","佥",
    "阡","軡","芊","芡","茜","輤","荨","掮","遷","岍","釺","鈆","鈐","鉗","鉛","悭","鋟","錢","骞","搴",
    "褰","鍼","鎆","鏲","缱","鑓","椠","肷","韆","愆","顅","钤","騚","騝","騫","虔","箝","鬜","鬝","鰬",
    "鵮","鹐",":qian"
    ,"唴","啌","嗆","嗴","墏","墻","嬙","嶈","廧","強","戧","搶","摤","斨","槍","檣","溬","漒","熗","牄",
    "牆","猐","獇","玱","琷","瑲","篬","繈","繦","羥","羻","艢","枪","呛","腔","羌","墙","蔷","强","抢",
    "薔","蘠","謒","蹌","蹡","戕","錆","鎗","嫱","鏘","鏹","樯","戗","炝","锖","锵","镪","襁","蜣","羟",
    "跄","鶬","鸧",":qiang"
    ,"偢","僑","僺","喬","喿","嘺","塙","墝","墧","墽","嶠","帩","幧","槗","橋","橾","毃","燆","犞","癄",
    "睄","硚","碻","磽","礄","竅","繰","翹","荍","菬","橇","锹","敲","悄","桥","瞧","乔","侨","巧","鞘",
    "撬","翘","峭","俏","窍","蕎","藮","誚","譙","劁","趬","诮","谯","踃","踍","蹺","躈","荞","郻","鄡",
    "鄥","峤","愀","憔","鍫","鍬","鏒","鐈","缲","鐰","樵","陗","鞩","鞽","韒","硗","頝","顦","髚","髜",
    "跷","鞒",":qiao"
    ,"倿","匧","厒","帹","悏","愜","朅","癿","稧","穕","竊","笡","篋","籡","緁","聺","苆","切","茄","且",
    "怯","窃","藒","詧","踥","郄","郤","惬","慊","鍥","妾","鐑","挈","锲","箧","鯜",":qie"
    ,"儭","吢","唚","坅","埁","媇","嫀","寑","寢","寴","嵚","嶔","庈","懃","懄","抋","捦","搇","撳","昑",
    "梫","櫬","欽","澿","瀙","珡","琹","瘽","矝","笉","綅","耹","菣","菦","钦","侵","亲","秦","琴","勤",
    "芹","擒","禽","寝","沁","菳","藽","螼","蠄","親","誛","赾","芩","揿","吣","嗪","噙","鈂","鈊","鈙",
    "溱","檎","雂","靲","顉","锓","駸","螓","骎","鬵","衾","鮼","鳹",":qin"
    ,"傾","凊","勍","埥","夝","庼","廎","慶","掅","暒","棾","樈","檾","櫦","殑","氫","淸","漀","濪","甠",
    "硘","碃","青","轻","氢","倾","卿","清","擎","晴","氰","情","顷","请","庆","請","苘","軽","輕","郬",
    "圊","鑋","檠","靘","頃","磬","蜻","罄","箐","鯖","謦","鲭","黥","鶄",":qing"
    ,"儝","卭","嬛","惸","憌","桏","橩","焪","焭","煢","熍","琁","瓊","睘","窮","竆","笻","琼","穷","藑",
    "藭","蛬","赹","邛","茕","穹","蛩","筇","跫","銎",":qiong"
    ,"丠","厹","叴","唒","坵","媝","寈","崷","巰","恘","扏","搝","梂","櫹","殏","毬","浗","湭","煪","玌",
    "璆","皳","盚","秌","穐","篍","紌","絿","緧","肍","莍","秋","丘","邱","球","求","囚","酋","泅","蘒",
    "虯","蛷","蝵","蟗","蠤","觓","觩","訅","賕","俅","趥","巯","逎","醔","釚","犰","釻","銶","湫","逑",
    "遒","楸","赇","鞦","鞧","虬","蚯","裘","糗","鮂","鯄","鰌","鰍","鳅","鰽","鱃","鼽","鵭","鶖","鹙",
    "龝",":qiu"
    ,"伹","佉","佢","刞","匤","區","厺","岨","岴","嶇","憈","戵","抾","斪","欋","浀","淭","灈","璖","竬",
    "筁","粬","紶","絇","耝","胊","胠","臒","臞","菃","趋","区","蛆","曲","躯","屈","驱","渠","葋","取",
    "娶","龋","趣","去","蟝","蠷","衐","袪","覰","覷","覻","詓","詘","匚","趍","趨","诎","跼","劬","躣",
    "軀","迲","蕖","蘧","岖","衢","阒","鑺","璩","閴","闃","阹","觑","氍","朐","祛","磲","鸲","駆","駈",
    "癯","驅","蛐","髷","蠼","麴","鰸","瞿","鱋","黢","麮","麯","麹","鼁","鼩","齲",":qu"
    ,"佺","勧","勸","姾","婘","孉","峑","巏","巻","恮","搼","椦","楾","権","權","洤","湶","灥","烇","牶",
    "牷","犈","瑔","甽","硂","絟","綣","縓","腃","葲","圈","颧","权","醛","泉","全","痊","拳","犬","券",
    "劝","虇","觠","詮","譔","诠","跧","荃","輇","銓","悛","鐉","绻","辁","闎","畎","铨","顴","駩","騡",
    "蜷","筌","鰁","鳈","鬈","齤",":quan"
    ,"卻","埆","崅","愨","慤","殻","燩","皵","碏","確","礭","缺","炔","瘸","却","鹊","榷","确","雀","蒛",
    "阕","阙","闋","闕","悫","鵲",":que"
    ,"囷","夋","峮","帬","羣","裙","群","裠","踆","逡",":qun"
    ,"冄","呥","嘫","姌","媣","珃","繎","肰","然","燃","冉","染","蒅","蚦","衻","袇","袡","苒","蚺","髥",
    "髯",":ran"
    ,"壌","孃","懹","爙","獽","穣","瓤","壤","攘","嚷","让","譲","讓","躟","禳","穰",":rang"
    ,"嬈","擾","橈","犪","繞","饶","扰","绕","襓","荛","遶","娆","桡","隢","饒",":rao"
    ,"渃","熱","惹","热",":re"
    ,"仭","刄","姙","屻","岃","忈","忎","扨","朲","栠","栣","梕","牣","秂","秹","紉","紝","絍","綛","纴",
    "肕","芢","荵","壬","仁","人","忍","韧","任","认","刃","妊","纫","袵","訒","認","讱","仞","躵","軔",
    "荏","鈓","饪","銋","轫","靭","靱","韌","飪","餁","稔","衽","魜","鵀",":ren"
    ,"礽","芿","扔","仍","辸",":reng"
    ,"囸","日","釰","鈤","馹","驲",":ri"
    ,"傇","媶","嫆","嬫","宂","峵","嶸","搈","摉","曧","栄","榮","榵","毧","氄","瀜","烿","爃","瑢","穁",
    "穃","絨","縙","羢","茙","戎","茸","蓉","荣","融","熔","溶","容","绒","冗","螎","蠑","褣","嵘","狨",
    "鎔","镕","榕","肜","駥","蝾",":rong"
    ,"媃","宍","楺","渘","煣","瑈","瓇","禸","粈","腬","葇","揉","柔","肉","輮","鍒","韖","騥","糅","蹂",
    "鰇","鞣","鶔",":rou"
    ,"侞","偄","嗕","媷","嶿","帤","扖","擩","曘","杁","桇","渪","燸","筎","縟","肗","茹","蠕","儒","孺",
    "如","辱","乳","汝","入","褥","蕠","袽","蓐","込","薷","鄏","嚅","醹","銣","洳","溽","濡","缛","顬",
    "铷","襦","颥","鱬","鳰","鴑","鴽",":ru"
    ,"壖","瑌","瓀","碝","礝","緛","软","阮","蝡","軟","朊",":ruan"
    ,"叡","壡","惢","撋","桵","橤","甤","緌","繠","蕊","瑞","锐","蘂","蘃","芮","蕤","銳","枘","睿","蚋",":rui"
    ,"橍","潤","闰","润","閏","閠",":run"
    ,"叒","嵶","楉","焫","爇","若","弱","蒻","偌","鄀","箬","鰙","鰯","鶸",":ruo"
    ,"桬","櫒","灑","撒","洒","萨","薩","訯","卅","仨","隡","脎","靸","飒","颯","馺",":sa"
    ,"僿","嗮","嘥","毢","毸","簺","腮","鳃","塞","赛","賽","噻","顋","鰓",":sai"
    ,"虄",":sal"
    ,"俕","傘","厁","壭","弎","橵","毶","毿","潵","犙","糂","糝","糣","糤","繖","三","叁","伞","散","彡",
    "馓","氵","閐","毵","饊","鬖",":san"
    ,"喪","桒","槡","桑","嗓","丧","褬","搡","鎟","磉","顙","颡",":sang"
    ,"掃","掻","氉","溞","矂","繅","搔","骚","扫","嫂","螦","埽","缫","臊","颾","瘙","騒","騷","髞","鰠",
    "鳋","鱢",":sao"
    ,"嗇","愬","懎","擌","栜","歮","歰","渋","溹","澀","澁","濇","濏","瀒","璱","瘷","穡","穯","繬","瑟",
    "色","涩","譅","啬","轖","銫","鎍","鏼","飋","铯","穑",":se"
    ,"森",":sen"
    ,"僧","鬙",":seng"
    ,"乷","倽","儍","唦","廈","挱","樧","殺","猀","硰","紗","繌","繺","翜","翣","萐","莎","砂","杀","刹",
    "沙","纱","傻","啥","煞","蔱","厦","賖","唼","閯","閷","歃","铩","痧","魦","裟","鯊","鯋","霎","鲨",":sha"
    ,"摋","曬","篩","簁","簛","筛","晒","釃","酾",":shai"
    ,"傓","僐","刪","剼","嘇","圸","墡","姍","幓","搧","敾","晱","曏","曑","杣","柵","椫","樿","檆","澘",
    "灗","炶","熌","狦","痁","睒","磰","穇","笘","笧","繕","纔","羴","羶","珊","苫","杉","山","删","煽",
    "衫","闪","陕","擅","赡","膳","善","汕","扇","缮","襂","覢","訕","栅","謆","譱","贍","赸","讪","鄯",
    "凵","埏","軕","芟","邖","釤","銏","潸","姗","嬗","骟","鐥","閃","閊","陝","膻","钐","饍","疝","騸",
    "蟮","舢","鯅","跚","鱔","鱣","鳝",":shan"
    ,"丄","仩","傷","坰","塲","恦","慯","殤","滳","緔","墒","伤","商","赏","晌","上","尚","裳","蔏","螪",
    "觴","謪","賞","垧","绱","鑜","殇","熵","鬺","觞",":shang"
    ,"卲","娋","弰","旓","柖","焼","燒","玿","紹","梢","捎","稍","烧","芍","勺","韶","少","哨","邵","绍",
    "蕱","袑","劭","輎","潲","杓","蛸","髾","筲","艄","鮹",":shao"
    ,"厙","弽","慴","懾","挕","捨","摵","攝","檨","欇","涻","磼","舎","奢","赊","蛇","舌","舍","赦","摄",
    "射","慑","涉","社","设","蔎","蛥","蠂","設","折","厍","賒","佘","輋","猞","滠","韘","畲","騇","麝",":she"
    ,"侁","侺","兟","叄","叅","堔","妽","嬸","審","屾","峷","弞","愼","扟","昚","曋","柛","棯","椮","榊",
    "槮","氠","滲","燊","珅","甡","甧","瘆","瘮","眒","眘","瞫","矤","祳","穼","籶","籸","紳","罧","脤",
    "腎","葠","蓡","砷","申","呻","伸","身","深","娠","绅","神","沈","审","婶","甚","肾","慎","渗","蔘",
    "薓","裑","覾","訠","訷","詵","讅","谉","诜","谂","莘","葚","邥","哂","鋠","渖","胂","頣","矧","駪",
    "蜃","魫","糁","鯓","鯵","鰰","鰺","鲹","鵢",":shen"
    ,"偗","剰","勝","呏","墭","憴","斘","昇","晠","曻","枡","榺","橳","殅","泩","渻","湦","焺","珄","竔",
    "縄","繩","聖","聲","苼","声","生","甥","牲","升","绳","蕂","省","盛","剩","胜","圣","譝","貹","賸",
    "嵊","鉎","鍟","阩","陞","陹","晟","眚","笙","鵿","鼪",":sheng"
    ,"丗","乨","乭","佀","佦","兘","冟","勢","卋","呞","呩","塒","奭","嬕","実","寔","實","屍","峕","嵵",
    "師","弒","恀","揓","旹","時","枾","栻","榁","榯","浉","湜","湤","溡","溮","溼","澨","濕","烒","煶",
    "獅","瑡","眂","眎","眡","睗","匙","祏","竍","笶","篒","簭","籂","籭","絁","舓","葹","蒒","蒔","师",
    "失","狮","施","湿","诗","尸","虱","十","石","拾","时","什","食","蚀","实","识","史","矢","使","屎",
    "驶","始","式","示","士","世","柿","事","拭","誓","逝","势","是","嗜","噬","适","仕","侍","释","饰",
    "氏","市","恃","室","视","试","蝕","蝨","褷","襫","襹","視","觢","試","詩","諡","識","貰","谥","埘",
    "軾","莳","蓍","辻","遈","適","遾","邿","弑","釈","釋","鈰","鉂","鉃","饣","鉐","鉽","鍦","鎩","轼",
    "贳","炻","礻","铈","飠","飾","駛","螫","舐","筮","魳","鮖","豕","鯴","鰘","鰣","鰤","鲥","鲺","鳲",
    "鳾","鶳","鸤","鼫","鼭",":shi"
    ,"収","垨","壽","夀","獣","獸","痩","綬","膄","收","手","首","守","寿","授","售","受","瘦","兽","醻",
    "狩","鏉","绶","艏",":shou"
    ,"倐","婌","尗","屬","庻","怷","捒","掓","數","書","柕","樞","樹","毺","潄","潻","濖","瀭","焂","璹",
    "疎","癙","竪","籔","糬","紓","絉","綀","荗","蒁","蔬","枢","梳","殊","抒","输","叔","舒","淑","疏",
    "书","赎","孰","熟","薯","暑","曙","署","蜀","黍","鼠","属","术","述","树","束","戍","竖","墅","庶",
    "数","漱","恕","虪","蠴","術","裋","豎","丨","倏","贖","踈","塾","軗","輸","菽","摅","鄃","忄","沭",
    "澍","錰","姝","鏣","纾","陎","毹","腧","殳","秫","鮛","鱪","鱰","鵨","鶐","鼡",":shu"
    ,"刷","耍","誜","唰",":shua"
    ,"帥","縗","缞","摔","衰","甩","帅","蟀",":shuai"
    ,"傱","腨","栓","拴","闩","涮","閂",":shuan"
    ,"塽","孇","慡","樉","欆","灀","礵","縔","艭","霜","双","爽","孀","鏯","雙","騻","驦","骦","鷞","鸘",
    "鹴",":shuang"
    ,"帨","氺","涗","涚","稅","脽","谁","水","睡","税","裞","説","誰","閖",":shui"
    ,"橓","瞚","瞤","蕣","吮","瞬","顺","舜","順","鬊",":shun"
    ,"欶","洬","燿","爍","矟","碩","说","硕","朔","烁","說","蒴","搠","妁","鎙","鑠","槊","铄",":shuo"
    ,"亖","価","俬","儩","凘","噝","娰","媤","孠","廝","恖","愢","柶","楒","榹","泀","泤","洍","涘","瀃",
    "牭","禗","禠","禩","竢","糹","絲","緦","罒","罳","肂","蕬","蕼","斯","撕","嘶","思","私","司","丝",
    "死","肆","寺","嗣","四","伺","似","饲","巳","螄","蟖","蟴","覗","貄","厮","俟","兕","厶","咝","釲",
    "鈻","鉰","汜","泗","銯","澌","鍶","姒","驷","鐁","缌","灬","祀","颸","飔","飤","飼","锶","鸶","駟",
    "耜","騦","蛳","笥","鷉","鷥","鼶",":si"
    ,"倯","娀","嵷","庺","愯","慫","憽","枀","枩","柗","梥","檧","濍","硹","聳","松","耸","怂","颂","送",
    "宋","讼","诵","蜙","訟","誦","凇","菘","崧","嵩","忪","悚","淞","鎹","頌","餸","駷","竦","鬆",":song"
    ,"傁","凁","叜","廀","廋","捜","摗","擻","櫢","獀","瘶","蒐","蓃","藪","搜","艘","擞","嗽","叟","薮",
    "鄋","嗖","嗾","醙","馊","溲","鎪","飕","瞍","颼","锼","餿","騪","螋",":sou"
    ,"傃","卹","囌","埣","塐","嫊","憟","榡","樎","樕","櫯","殐","泝","溸","潥","玊","珟","璛","甦","穌",
    "窣","粛","縤","肅","膆","藗","苏","酥","俗","素","速","粟","僳","塑","溯","诉","肃","蘇","蘓","訴",
    "謖","夙","趚","谡","蹜","蔌","遡","遬","嗉","愫","鋉","涑","餗","驌","骕","簌","鯂","觫","稣","鱐",
    "鷫","鹔",":su"
    ,"匴","痠","祘","笇","筭","酸","蒜","算","狻",":suan"
    ,"亗","倠","哸","夊","嬘","旞","檖","歲","歳","滖","澻","瀡","煫","璲","瓍","砕","禭","穂","穟","簑",
    "綏","繐","繸","芕","荾","虽","隋","随","绥","髓","碎","岁","穗","遂","隧","祟","襚","誶","譢","賥",
    "谇","荽","遀","濉","邃","鐆","鐩","隨","雖","鞖","燧","眭","睢","髄",":sui"
    ,"孫","巺","損","搎","槂","潠","猻","畃","筍","箰","蓀","蕵","薞","孙","损","笋","荪","狲","飧","鎨",
    "榫","隼",":sun"
    ,"傞","嗩","嵗","摍","暛","溑","琑","瑣","簔","縮","莏","蓑","梭","唆","缩","琐","索","锁","所","蜶",
    "趖","逤","唢","嗦","嗍","鎖","鎻","鏁","娑","桫","挲","睃","髿","羧","鮻",":suo"
    ,"侤","傝","咜","嚃","嚺","墖","崉","撻","榙","毾","涾","澾","濌","狧","獺","祂","禢","塌","他","它",
    "她","塔","獭","挞","蹋","踏","褟","誻","譶","蹹","躢","遝","鉈","闼","溻","錔","遢","榻","闒","闥",
    "阘","鞜","鞳","沓","铊","趿","鰨","鳎",":ta"
    ,"儓","冭","咍","囼","坮","夳","嬯","孡","忕","忲","態","擡","斄","檯","溙","漦","炲","燤","箈","籉",
    "粏","臺","舦","菭","胎","苔","抬","台","泰","酞","太","态","汰","邰","薹","呔","鈦","肽","炱","钛",
    "颱","駘","鮐","跆","鲐",":tai"
    ,"僋","啴","嗿","嘆","嘽","埮","墰","墵","壇","壜","婒","怹","憛","憳","憻","擹","攤","暺","曇","榃",
    "歎","湠","潬","灘","璮","痑","癱","緂","罈","罎","舑","舕","菼","蕁","藫","坍","摊","贪","瘫","滩",
    "坛","檀","痰","潭","谭","谈","坦","毯","袒","碳","探","叹","炭","襢","談","譚","譠","貚","貪","郯",
    "醓","醰","鉭","錟","鐔","昙","忐","顃","钽","锬","镡","覃","鷤",":tan"
    ,"伖","傏","儻","劏","啺","嘡","坣","戃","摥","攩","曭","榶","橖","湯","漟","漡","煻","燙","爣","矘",
    "磄","禟","篖","糃","糛","膅","蓎","薚","汤","塘","搪","堂","棠","膛","唐","糖","倘","躺","淌","趟",
    "烫","蝪","傥","赯","踼","蹚","鄌","帑","饧","溏","鎕","鎲","鏜","鐋","钂","瑭","镋","樘","闛","隚",
    "鞺","铴","镗","餳","餹","饄","耥","螗","螳","羰","醣","鶶","鼞",":tang"
    ,"仐","咷","嫍","幍","弢","慆","搯","梼","槄","檮","涭","濤","燾","瑫","祹","絛","綯","縚","縧","绹",
    "掏","涛","滔","绦","萄","桃","逃","淘","陶","讨","套","蜪","裪","討","詜","謟","鼗","轁","迯","啕",
    "醄","鋾","洮","韬","鞀","鞉","焘","鞱","韜","飸","饀","駣","騊","饕",":tao"
    ,"畓",":tap"
    ,"犆","脦","特","螣","蟘","貣","鋱","忑","慝","铽",":te"
    ,"儯","幐","漛","痋","籐","籘","縢","膯","虅","藤","腾","疼","誊","謄","邆","滕","霯","駦","騰","驣",
    "鰧","鼟",":teng"
    ,"偍","厗","嗁","嚔","姼","媞","屜","崹","徥","徲","悐","惖","惿","戻","挮","掦","擿","楴","歒","殢",
    "洟","漽","瑅","瓋","磃","稊","穉","籊","綈","緹","罤","蕛","薙","虒","梯","剔","踢","锑","提","题",
    "蹄","啼","体","替","嚏","惕","涕","剃","屉","蝭","衹","褅","褆","謕","倜","趧","躰","軆","扌","逷",
    "遆","悌","銻","鍗","逖","鐟","绨","缇","題","鹈","裼","騠","骵","體","髰","鬀","鮷","醍","鯷","鳀",
    "鵜","鶗","鶙","鷈",":ti"
    ,"倎","兲","呑","唺","塡","娗","婖","寘","屇","悿","捵","搷","晪","沺","淟","湉","琠","瑱","璳","甛",
    "畑","畠","盷","睓","睼","瞋","碵","磌","窴","紾","胋","舚","菾","天","添","填","田","甜","恬","舔",
    "腆","覥","觍","賟","掭","酟","銛","忝","阗","錪","鍩","铦","殄","闐","靔","靝","畋","餂","鴫","鷆",
    "鷏","黇",":tian"
    ,"儵","宨","岧","岹","庣","旫","晀","朓","條","樤","祒","窱","糶","聎","脁","芀","萔","蓚","蓨","挑",
    "条","迢","眺","跳","螩","覜","佻","趒","苕","銚","鋚","鎥","鞗","祧","頫","窕","蜩","笤","粜","鯈",
    "鰷","龆","鲦","髫","齠",":tiao"
    ,"僣","呫","怗","聑","贴","铁","帖","蛈","貼","萜","鐵","飻","驖","餮","鴩",":tie"
    ,"侱","侹","厛","圢","嵉","庁","廰","廳","楟","榳","涏","渟","烴","烶","珵","珽","筳","綎","耓","聤",
    "聴","聼","聽","脡","厅","听","烃","汀","廷","停","亭","庭","挺","艇","蝏","誔","諪","莛","葶","邒",
    "婷","梃","閮","鞓","頲","颋","蜓","霆","鼮",":ting"
    ,"哃","囲","峂","庝","慟","憅","晍","曈","朣","樋","橦","氃","浵","炵","熥","燑","爞","犝","狪","獞",
    "痌","眮","秱","穜","粡","統","綂","膧","蓪","蚒","通","桐","酮","瞳","同","铜","彤","童","桶","捅",
    "筒","统","痛","冂","佟","僮","仝","赨","茼","嗵","恸","鉖","鉵","銅","潼","砼","餇","鮦","鲖",":tong"
    ,"偸","埱","妵","敨","斢","紏","綉","緰","蘣","偷","投","头","透","鍮","頭","钭","骰","黈",":tou"
    ,"兎","凃","唋","図","圖","圗","圡","堗","塗","宊","峹","嵞","嶀","庩","廜","捈","捸","揬","梌","汢",
    "涋","湥","潳","瑹","痜","瘏","禿","稌","筡","莵","葖","蒤","凸","秃","突","图","徒","途","涂","屠",
    "土","吐","兔","堍","荼","菟","迌","釷","鈯","鋵","鍎","钍","馟","駼","酴","鵌","鵚","鵵","鶟","鷋",
    "鷵","鼵",":tu"
    ,"剸","団","圕","團","塼","嫥","慱","摶","槫","檲","湪","漙","煓","猯","畽","篿","糰","蓴","湍","团",
    "褖","貒","抟","彖","鏄","疃","鱄","鷒","鷻",":tuan"
    ,"俀","僓","墤","娧","尵","焞","穨","脮","蓷","藬","蘈","蛻","推","颓","腿","蜕","褪","退","蹆","蹪",
    "忒","隤","煺","頹","頺","頽","駾","騩","骽","魋",":tui"
    ,"啍","噋","坉","忳","旽","朜","汭","臋","芚","吞","屯","臀","豘","氽","軘","饨","暾","霕","豚","飩",
    "魨","鲀","黗",":tun"
    ,"侂","侻","咃","堶","岮","拕","挩","捝","杔","棁","楕","槖","毤","毻","汑","涶","牠","砤","碢","籜",
    "紽","脫","舃","莌","萚","蘀","拖","托","脱","鸵","陀","驮","驼","椭","妥","拓","唾","袉","袥","託",
    "讬","乇","佗","跅","踻","坨","軃","迆","庹","沱","鋖","柝","柁","橐","陁","砣","飥","饦","馱","馲",
    "駝","駞","騨","驒","驝","箨","魠","鮀","酡","跎","鼍","鱓","鴕","鵎","鼉","鼧",":tuo"
    ,"劸","咓","嗗","嗢","姽","媧","屲","帓","徍","搲","攨","溛","漥","瓲","畖","砙","窊","窐","窪","聉",
    "膃","挖","哇","蛙","洼","娃","瓦","袜","襪","譁","佤","邷","娲","腽","靺","韈","韎","韤","鼃",":wa"
    ,"咼","喎","瀤","竵","歪","外","崴","顡",":wai"
    ,"乛","倇","刓","卍","卐","唍","埦","塆","壪","夗","夘","妧","婠","孯","岏","帵","彎","忨","惌","抏",
    "捖","捥","掔","晩","晼","杤","梚","椀","汍","潫","灣","琓","盌","睕","笂","紈","綩","綰","翫","脕",
    "莬","萬","薍","蚖","豌","弯","湾","玩","顽","丸","烷","完","碗","挽","晚","皖","惋","宛","婉","万",
    "腕","貦","剜","贃","贎","芄","輐","輓","莞","菀","邜","鄤","鋄","鋔","錽","鍐","鎫","纨","绾","琬",
    "関","闗","脘","頑","畹","蜿","魭",":wan"
    ,"仼","尩","尪","尫","彺","徃","忹","抂","暀","朢","棢","瀇","焹","琞","盳","網","罖","莣","菵","蚟",
    "蛧","汪","王","亡","枉","网","往","旺","望","忘","妄","蝄","誷","罔","輞","迋","迬","惘","辋","魍",":wang"
    ,"亹","偉","偽","僞","儰","叞","喡","喴","圍","墛","壝","媁","媙","媦","寪","峗","峞","崣","嵔","嶶",
    "幃","廆","徫","恑","愄","愇","懀","捤","揋","揻","撝","撱","斖","暐","梶","椲","椳","楲","欈","洈",
    "浘","渨","湋","溈","溦","潿","濊","濰","濻","瀢","為","烓","煀","煒","煟","熭","燰","爲","犚","犩",
    "琟","瑋","璏","瓗","癐","癓","硊","硙","碨","磈","磑","維","緭","緯","縅","罻","腲","膸","芛","苿",
    "茟","荱","菋","葦","葨","蒍","蓶","蔿","薳","藯","蘶","威","蜲","蜹","蜼","蝛","蝟","巍","微","危",
    "韦","违","桅","围","唯","惟","为","潍","维","苇","萎","委","伟","伪","尾","纬","未","蔚","味","畏",
    "胃","喂","魏","位","渭","谓","尉","慰","卫","螱","衛","衞","褽","覣","覹","觹","觽","觿","詴","諉",
    "謂","讆","讏","偎","趡","诿","隈","隗","踓","躗","躛","葳","轊","薇","違","鄬","囗","帏","醀","帷",
    "嵬","猥","猬","闱","沩","洧","涠","錗","鍏","鍡","逶","娓","鏏","玮","韪","闈","隇","軎","霨","霺",
    "炜","煨","韋","韑","韙","韡","頠","颹","餧","餵","饖","痿","骩","骪","骫","艉","鮇","鮠","鮪","鰃",
    "鰄","鰖","鲔","鳂","鳚",":wei"
    ,"呅","呚","呡","問","塭","妏","彣","忞","忟","抆","搵","昷","桽","榅","榲","歾","殟","渂","溫","炆",
    "珳","瑥","瘒","砇","穏","穩","紋","絻","緼","縕","缊","聞","肳","脗","芠","蕰","薀","藴","蚉","螡",
    "瘟","温","蚊","文","闻","纹","吻","稳","紊","问","蟁","褞","豱","刎","亠","輼","辒","鈫","阌","汶",
    "鎾","璺","閺","閿","闅","闦","鞰","顐","饂","馼","魰","鰛","鰮","雯","鳁","鳼","鴍","鴖","鼤",":wen"
    ,"塕","奣","嵡","暡","滃","甕","瞈","罋","聬","螉","嗡","翁","瓮","蓊","蕹","鎓","鶲","鹟","齆",":weng"
    ,"仴","偓","唩","嚄","堝","婐","婑","媉","捰","捼","捾","撾","枂","楃","涴","涹","渦","濄","濣","猧",
    "瓁","瞃","窩","腛","臥","艧","萵","蒦","薶","蝸","挝","蜗","涡","窝","我","斡","卧","握","沃","倭",
    "踒","踠","莴","喔","幄","渥","雘","肟","硪","馧","龌","齷","龏",":wo"
    ,"乄","亾","伆","俉","倵","儛","兦","剭","務","吳","呉","啎","嗚","噁","塢","墲","奦","娒","娪","娬",
    "嫵","屼","岉","嵍","嵨","幠","廡","弙","忢","悞","悮","憮","扝","扤","揾","摀","敄","旿","杅","杇",
    "橆","洖","洿","渞","溩","潕","烏","無","熃","熓","玝","珷","珸","瑦","璑","甒","瞴","矹","碔","祦",
    "禑","窏","窹","箼","粅","膴","茣","莁","蕪","螐","巫","呜","钨","乌","污","诬","屋","无","芜","梧",
    "吾","吴","毋","武","五","捂","午","舞","伍","侮","坞","戊","雾","晤","物","勿","务","悟","误","蟱",
    "誈","誣","誤","譕","兀","仵","趶","阢","邬","圬","躌","芴","逜","郚","鄔","釫","庑","怃","忤","鋙",
    "浯","錻","寤","迕","妩","鎢","婺","骛","铻","杌","陚","牾","隖","雺","霚","霧","靰","焐","鹉","鹜",
    "痦","騖","蜈","鯃","鰞","鋈","鼯","鴮","鵐","鵡","鶩","鷡","鹀","鼿","齀",":wu"
    ,"係","俙","傒","凞","匸","卌","卥","厀","呬","咥","唽","噏","嚱","囍","塈","壐","娭","嬆","宩","屃",
    "屖","嵠","嶍","巇","徆","徯","忥","怬","怸","恄","悕","惁","慀","憘","憙","戲","扱","扸","晞","晳",
    "暿","杫","枲","桸","椞","椺","榽","橀","橲","欪","氥","渓","滊","漇","漝","潟","澙","焁","焈","焟",
    "煕","熂","熺","熻","燍","燨","爔","犔","犠","犧","狶","獡","琋","璽","瘜","睎","瞦","磶","礂","窸",
    "糦","細","綌","緆","縰","繥","绤","習","翖","肹","莃","葈","蒠","蒵","蓆","蕮","薂","虩","蜤","昔",
    "熙","析","西","硒","矽","晰","嘻","吸","锡","牺","蟢","稀","息","希","悉","膝","夕","惜","熄","烯",
    "溪","汐","犀","檄","袭","席","习","媳","喜","铣","洗","系","隙","戏","细","蠵","衋","襲","覀","覡",
    "覤","訢","諰","謑","謵","譆","豀","豨","豯","貕","僖","兮","赥","赩","趇","趘","隰","蹝","郗","躧",
    "菥","葸","蓰","奚","唏","郋","鄎","酅","徙","釳","釸","鈒","鈢","饩","鉩","銑","阋","浠","淅","錫",
    "屣","鎴","嬉","鏭","玺","鑴","钑","閪","樨","闟","曦","觋","隟","隵","雭","霫","霼","欷","歙","熹",
    "禊","禧","飁","餏","餙","餼","饻","皙","穸","騱","騽","蜥","驨","螅","蟋","鬩","舄","舾","羲","粞",
    "翕","鯑","醯","鰼","鱚","鳛","鼷","鵗","鸂","黖",":xi"
    ,"丅","乤","俠","傄","嚇","圷","峽","懗","敮","昰","梺","溊","炠","烚","狹","珨","疜","睱","硤","碬",
    "祫","筪","縀","縖","翈","舝","舺","蕸","蝦","瞎","虾","匣","霞","辖","暇","峡","侠","狭","下","夏",
    "吓","谺","赮","轄","郃","狎","鍜","遐","鎋","鏬","瑕","柙","閕","陜","陿","硖","颬","騢","罅","魻",
    "鰕","黠","鶷",":xia"
    ,"仚","伭","佡","僊","僩","僲","僴","咞","哯","啣","嘕","垷","奾","妶","姭","姺","娨","娹","婱","嫺",
    "嫻","尟","尠","屳","峴","幰","廯","忺","憪","憲","憸","挦","搟","撊","攇","晛","枮","櫶","毨","澖",
    "瀗","灦","烍","狝","獫","獮","獻","玁","珗","現","甉","癇","癎","県","睍","礥","禒","秈","箲","粯",
    "絤","綫","線","縣","縿","繊","纖","缐","羨","胘","脇","臔","臽","苮","莧","蘚","蚿","蛝","蜆","掀",
    "锨","先","仙","鲜","纤","咸","贤","衔","舷","闲","涎","弦","嫌","显","险","现","献","县","腺","馅",
    "羡","宪","陷","限","线","褼","襳","誢","誸","譣","豏","賢","冼","贒","赻","蹮","躚","軐","苋","莶",
    "藓","岘","猃","銜","鋧","鍁","鍌","暹","娴","鏾","鑦","閑","陥","険","險","氙","燹","祆","韅","韯",
    "韱","顕","顯","餡","鹇","痫","馦","蚬","筅","籼","鮮","酰","跣","跹","霰","鱻","鶱","鷳","鷴","鷼",
    "鼸",":xian"
    ,"亯","佭","傢","儴","勨","勷","嚮","姠","嶑","廂","忀","晑","栙","楿","欀","珦","瓖","絴","緗","纕",
    "缿","膷","萫","薌","蘘","蚃","蠁","相","厢","镶","香","箱","襄","湘","乡","翔","祥","详","想","响",
    "享","项","巷","橡","像","向","象","襐","詳","跭","芗","葙","郷","鄉","鄊","鄕","饷","庠","鋞","骧",
    "鐌","缃","鑲","響","項","餉","饗","饟","驤","蟓","鬨","鮝","鯗","鲞","鱌","鱜","鱶","飨","麘",":xiang"
    ,"侾","俲","傚","効","咲","啋","嘋","嘨","嘯","嘵","囂","婋","宯","庨","彇","恷","揱","撨","敩","斅",
    "斆","暁","曉","梟","橚","歊","毊","洨","涍","滧","潚","澩","瀟","灱","灲","烋","焇","熽","猇","獢",
    "痚","痟","皢","硣","穘","窙","笹","筿","箾","篠","簘","簫","綃","翛","膮","莦","萷","蕭","虈","虓",
    "蟂","蟏","蟰","萧","硝","霄","哮","嚣","销","消","宵","淆","晓","蠨","小","孝","校","肖","啸","笑",
    "效","詨","誟","誵","謏","哓","崤","銷","潇","逍","骁","绡","枭","枵","颵","驍","髇","髐","筱","箫",
    "魈","鴞","鴵","鵁","鷍","鸮",":xiao"
    ,"伳","偰","僁","冩","協","卨","嗋","噧","垥","塮","夑","娎","媟","寫","屓","屟","屧","屭","徢","恊",
    "愶","拹","揳","擕","擷","攜","旪","暬","榝","洩","澥","瀉","灺","炧","炨","烲","焎","熁","燲","爕",
    "瑎","碿","祄","禼","糏","絬","綊","緳","纈","缷","翓","脅","脋","膎","薢","藛","蝑","蝢","蠍","蠏",
    "衺","楔","些","歇","蝎","鞋","协","携","邪","斜","胁","谐","写","械","卸","蟹","懈","泄","泻","谢",
    "屑","褉","褻","襭","諧","謝","讗","偕","亵","勰","燮","躠","薤","撷","獬","廨","渫","瀣","邂","绁",
    "缬","榭","榍","鞢","鞵","韰","魼","躞","齂","齘","齛","齥","龤",":xie"
    ,"伩","俽","噺","妡","嬜","孞","惞","杺","枔","潃","炘","焮","盺","脪","舋","薪","芯","锌","欣","辛",
    "新","忻","心","信","衅","襑","訫","囟","馨","邤","釁","鋅","阠","昕","歆","馫","鑫",":xin"
    ,"侀","倖","哘","垶","娙","婞","嬹","曐","洐","涬","煋","狌","瑆","皨","睲","箵","篂","緈","臖","興",
    "莕","蛵","星","腥","猩","惺","兴","刑","型","形","邢","醒","幸","杏","性","姓","裄","觪","觲","謃",
    "陉","荇","擤","鉶","悻","铏","硎","騂","骍","鮏","鯹",":xing"
    ,"兇","哅","忷","恟","敻","洶","胷","兄","凶","胸","匈","汹","雄","熊","訩","詗","詾","讻","诇","芎",":xiong"
    ,"俢","樇","滫","烌","珛","琇","璓","糔","綇","繍","繡","脙","臰","臹","苬","宿","螑","休","修","羞",
    "朽","嗅","锈","秀","袖","绣","咻","岫","馐","庥","銝","溴","鎀","鏅","鏥","鏽","飍","饈","鸺","髤",
    "鮴","貅","髹","鵂","齅",":xiu"
    ,"伵","侐","俆","偦","冔","勗","喣","嘼","噓","垿","壻","姁","媭","嬃","幁","怴","慉","敍","敘","旴",
    "昫","暊","朂","楈","槒","欨","欰","欻","歔","歘","殈","汿","沀","湑","滀","漵","潊","烅","烼","珝",
    "珬","疞","盢","盨","瞁","瞲","稰","稸","窢","続","緒","緖","縃","繻","續","聓","聟","芧","蒣","蕦",
    "藚","虗","虛","墟","戌","需","虚","嘘","须","徐","许","蓄","酗","叙","旭","序","恤","絮","婿","绪",
    "续","裇","訏","許","訹","詡","諝","譃","谞","賉","诩","勖","圩","蓿","鄦","鉥","洫","溆","顼","鑐",
    "栩","煦","須","頊","盱","胥","驉","鬚","魆","魖","糈","醑",":xu"
    ,"吅","咺","塇","夐","媗","嫙","怰","愃","愋","懸","昍","昡","晅","暶","檈","煖","玆","玹","琄","瑄",
    "璿","癬","眴","睻","矎","禤","箮","絃","絢","縼","繏","翧","翾","萲","蓒","蔙","蕿","藼","蘐","蜁",
    "蝖","蠉","衒","袨","轩","喧","宣","悬","旋","玄","选","癣","眩","绚","諠","諼","譞","儇","贙","谖",
    "軒","萱","揎","選","鉉","泫","渲","漩","鍹","鏇","璇","楦","暄","炫","煊","碹","铉","颴","镟","痃",
    "駨","駽","鰚",":xuan"
    ,"乴","坹","學","岤","峃","嶨","斈","桖","樰","泧","瀥","烕","燢","狘","疶","膤","艝","茓","蒆","削",
    "袕","靴","薛","学","穴","雪","血","趐","谑","轌","噱","雤","鞾","泶","踅","鱈","鳕","鷽","鸴",":xue"
    ,"伨","侚","偱","勛","勲","勳","卂","咰","噀","噚","嚑","坃","塤","壎","壦","奞","尋","愻","揗","撏",
    "攳","杊","栒","桪","樳","殾","毥","潯","濬","燅","燖","燻","爋","狥","珣","璕","矄","稄","紃","浚",
    "纁","臐","薫","蘍","蟳","勋","熏","循","旬","询","寻","驯","巡","殉","汛","训","讯","逊","迅","訊",
    "訓","訙","詢","賐","巽","郇","埙","荀","迿","蕈","薰","遜","鄩","峋","徇","獯","恂","洵","浔","彐",
    "鑂","曛","顨","馴","窨","醺","鲟","鱏","鱘","鶽",":xun"
    ,"亜","亞","俹","劜","厊","厑","厓","呾","唖","啞","圔","圠","圧","埡","堐","壓","婭","孲","崕","庌",
    "庘","拁","挜","掗","枒","椏","椻","氬","漄","潝","犽","猚","猰","玡","瑘","疨","瘂","稏","穵","窫",
    "笌","聐","蕥","压","押","鸦","鸭","呀","丫","芽","牙","蚜","崖","衙","涯","雅","哑","亚","讶","襾",
    "訝","伢","垭","輵","揠","岈","釾","錏","迓","娅","鐚","琊","铔","桠","氩","砑","睚","顔","痖","疋",
    "鴉","鴨","鵶","鼼","齖",":ya"
    ,"乵","偐","偣","傿","儼","兗","円","剦","匽","厃","厭","厳","厴","唌","啱","喭","噞","嚥","嚴","塩",
    "墕","壛","壧","夵","妟","姲","姸","娫","娮","嬊","嬐","嬮","嬿","孍","崄","嵃","嵒","嵓","嶖","嶮",
    "巌","巖","巗","巘","巚","廵","弇","彥","愝","慇","懕","扊","抁","挻","掞","揅","揜","敥","昖","暥",
    "曕","曮","棪","椼","楌","樮","橪","檿","櫩","欕","沇","淊","渰","渷","湺","溎","漹","灎","灔","灧",
    "灩","炏","烻","焔","煙","熖","燄","爓","牪","狿","猒","珚","琂","甗","硏","硯","硽","碞","礹","篶",
    "簷","綖","臙","艶","艷","莚","菴","萒","葕","蔅","虤","蝘","裺","褗","焉","咽","阉","烟","淹","盐",
    "严","研","蜒","岩","延","言","颜","阎","炎","沿","奄","掩","眼","衍","演","艳","堰","燕","厌","砚",
    "雁","唁","彦","焰","宴","谚","验","覎","觃","觾","訁","訮","詽","諺","讌","讞","豓","豔","豜","豣",
    "厣","赝","剡","贋","俨","偃","兖","贗","讠","谳","阽","郾","鄢","躽","軅","菸","郔","酀","酓","醃",
    "醶","醼","釅","崦","恹","闫","湮","滟","妍","嫣","琰","閆","閹","閻","檐","阭","隁","晏","隒","胭",
    "腌","焱","顏","顑","顩","罨","饜","騐","験","騴","驗","驠","筵","鬳","魘","酽","鰋","魇","餍","鼹",
    "鳫","鴈","鶠","鷃","鷰","鹽","麙","麣","麲","黡","黤","黫","黬","黭","黰","黶","鼴","齗","齞","齴",
    "龂","龑",":yan"
    ,"佒","傟","劷","勜","咉","坱","垟","奍","姎","婸","岟","崵","崸","慃","懩","抰","揚","攁","敭","旸",
    "昜","暘","柍","楊","楧","様","樣","歍","氜","氱","瀁","炴","煬","珜","瑒","瘍","癢","眏","眻","礢",
    "禓","紻","羏","羕","羪","胦","殃","央","鸯","秧","杨","扬","佯","疡","羊","洋","阳","氧","仰","痒",
    "养","样","漾","詇","諹","軮","輰","徉","怏","鉠","泱","鍈","鍚","鐊","钖","阦","陽","雵","霙","霷",
    "炀","烊","恙","颺","飏","飬","養","駚","蛘","鰑","鞅","鴦","鴹","鸉",":yang"
    ,"仸","倄","偠","傜","僥","匋","喓","嗂","噛","垚","堯","婹","媱","宎","尭","岆","峣","嶢","嶤","徺",
    "怮","恌","愮","抭","揺","搖","摿","撽","暚","曣","枖","柼","楆","榚","榣","殀","殽","溔","烄","烑",
    "熎","狕","猺","獟","玅","瑤","矅","磘","祅","穾","窅","窔","窯","窰","筄","箹","籥","侥","纅","艞",
    "苭","葯","葽","蓔","蕘","薬","藥","蘨","袎","邀","腰","妖","瑶","覞","摇","尧","遥","窑","谣","姚",
    "咬","舀","药","要","耀","訞","詏","钥","謠","謡","讑","夭","爻","踰","軺","遙","吆","崾","徭","鎐",
    "幺","珧","鑰","杳","闄","轺","曜","肴","靿","顤","颻","飖","餆","铫","餚","鹞","窈","騕","繇","鰩",
    "鳐","鴢","鷂","鷕","齩",":yao"
    ,"亪","亱","倻","偞","僷","吔","啘","嘢","嚈","埜","墷","壄","峫","嶪","嶫","抴","捓","捙","擖","擛",
    "擨","擪","擫","暍","曄","曅","曗","枼","枽","楪","業","歋","殕","殗","洂","漜","潱","澲","煠","熀",
    "燁","爗","爺","瓛","皣","瞱","瞸","礏","緤","葉","虵","蠮","蠱","椰","噎","耶","爷","野","冶","也",
    "页","掖","业","叶","曳","腋","夜","液","謁","靥","谒","邺","揶","鄓","鄴","鋣","鍱","鎁","鎑","鐷",
    "晔","靨","烨","頁","铘","餣","饁","馌","驜","鵺","鸈","黦",":ye"
    ,"膶",":yen"
    ,"乁","亄","伇","伿","佁","侇","俋","偯","儀","億","儗","兿","冝","劮","勚","勩","匇","匜","叕","吚",
    "呭","呹","唈","囈","圛","坄","垼","墿","壱","夁","妷","媐","嫕","嫛","嬄","嬑","嬟","宐","宧","寱",
    "寲","峓","崺","嶧","嶬","巸","帟","帠","幆","庡","廙","弌","弬","彛","彜","彞","彵","忔","怈","恞",
    "悘","悥","憶","懌","戺","扅","扆","拸","掜","撎","攺","敡","敼","斁","旑","昳","晹","暆","曀","曎",
    "曵","杙","杝","枍","枻","柂","栘","栧","栺","桋","棭","椬","椸","榏","槸","樴","檍","檥","檹","欥",
    "欭","歖","歝","殔","殹","毉","沶","泆","洢","浂","浥","浳","湙","潩","澺","瀷","炈","焬","焲","熈",
    "熤","熪","熼","燚","燡","燱","狋","狏","獈","玴","珆","瑿","瓵","畩","異","痬","瘞","瘱","癦","睪",
    "瞖","礒","祎","禕","稦","穓","竩","笖","箷","簃","籎","紲","絏","縊","繄","繶","繹","羛","羠","義",
    "耛","耴","肊","膉","艗","艤","芅","苅","苢","萓","萟","蓺","藙","藝","蘙","虉","蛜","蛡","蛦","螔",
    "螘","螠","蟻","衪","衵","袆","袘","袣","裛","裿","褘","褹","襗","襼","一","壹","医","揖","铱","依",
    "伊","衣","颐","夷","遗","移","仪","胰","疑","沂","宜","姨","彝","椅","蚁","倚","已","乙","矣","以",
    "艺","抑","易","邑","屹","亿","役","臆","逸","肄","疫","亦","裔","意","毅","忆","义","益","溢","诣",
    "议","谊","译","异","翼","翌","绎","觺","訑","訲","訳","詍","詒","詣","誃","誼","謚","謻","譩","譯",
    "議","讉","讛","豙","豛","豷","貖","貤","刈","劓","仡","佚","貽","贀","佾","跇","诒","跠","圯","埸",
    "懿","苡","荑","軼","輗","輢","轙","辥","辷","迱","迻","逘","薏","弈","奕","挹","遺","弋","呓","咦",
    "咿","郼","噫","醫","醳","醷","釔","峄","嶷","釴","釶","鈘","鈠","猗","饴","怿","怡","鉇","鉯","銕",
    "銥","悒","漪","錡","迤","鎰","驿","鏔","缢","鐿","钀","锜","殪","轶","阣","阤","陭","贻","隿","霬",
    "靾","欹","旖","熠","頉","眙","頤","頥","顊","顗","钇","飴","镒","镱","饐","痍","瘗","駅","癔","翊",
    "衤","蜴","驛","骮","舣","羿","翳","酏","鮧","鮨","鯣","黟","鳦","鴺","鶂","鶃","鶍","鷁","鷊","鷖",
    "鷧","鷾","鸃","鹝","鹢","鹥","黓","黳","齮","齸",":yi"
    ,"乑","乚","伒","侌","凐","唫","噖","噾","嚚","囙","圁","垔","垽","堷","婣","婬","峾","崟","崯","嶾",
    "廕","愔","慭","憖","憗","懚","斦","朄","栶","梀","檃","檭","檼","櫽","歅","殥","泿","洕","淾","湚",
    "溵","滛","濥","濦","烎","犾","猌","玪","珢","璌","瘖","癊","癮","碒","磤","禋","秵","筃","粌","絪",
    "緸","縯","苂","荶","蒑","蔩","蔭","蘟","螾","蟫","裀","茵","荫","因","殷","音","阴","姻","吟","银",
    "淫","寅","饮","尹","引","隐","訔","訚","印","訡","誾","諲","讔","胤","赺","趛","鄞","垠","堙","茚",
    "輑","吲","喑","酳","狺","釿","鈏","鈝","夤","銀","銦","洇","闉","阥","陰","陻","隂","隠","隱","霒",
    "霠","氤","靷","鞇","韾","铟","飮","飲","駰","瘾","蚓","骃","鮣","霪","龈","鷣","齦",":yin"
    ,"俓","偀","僌","啨","営","噟","嚶","塋","夃","媖","嫈","嬰","孆","孾","嵤","巆","巊","廮","応","愥",
    "應","摬","攍","攖","攚","旲","暎","朠","桜","桯","梬","櫻","櫿","泂","浧","渶","溁","溋","滎","潁",
    "濙","濚","濴","瀅","瀠","瀯","瀴","灐","灜","焽","煐","熒","營","珱","瑩","瓔","甇","甖","癭","盁",
    "矨","碤","礯","穎","籝","籯","緓","縈","纓","绬","罃","罌","耺","膡","萾","藀","蘡","蛍","蝧","蝿",
    "螢","蠅","蠳","褮","覮","英","樱","婴","鹰","应","缨","莹","萤","营","荧","蝇","迎","赢","盈","影",
    "颖","硬","映","謍","譍","譻","賏","嬴","贏","郢","軈","茔","荥","莺","萦","蓥","撄","嘤","膺","滢",
    "潆","瀛","鎣","鐛","瑛","鑍","璎","锳","楹","媵","鞕","韹","韺","頴","颕","鹦","瘿","颍","罂","鱦",
    "鴬","鶧","鶯","鷪","鷹","鸎","鸚",":ying"
    ,"喲","嚛","哟","唷",":yo"
    ,"傛","勈","嗈","噰","埇","塎","嫞","嵱","廱","彮","怺","悀","惥","愑","愹","慂","揘","擁","柡","栐",
    "槦","湧","滽","澭","灉","牅","癕","癰","砽","硧","禜","筩","苚","拥","佣","臃","痈","庸","雍","踊",
    "蛹","咏","泳","涌","永","恿","勇","用","詠","俑","踴","壅","墉","郺","鄘","喁","醟","慵","銿","鏞",
    "邕","雝","镛","甬","鯒","鰫","鱅","鲬","鳙","饔","鷛",":yong"
    ,"丣","亴","偤","優","冘","哊","唀","嚘","妋","姷","孧","尣","峟","峳","庮","怞","怣","憂","懮","戭",
    "揂","斿","栯","梄","楢","槱","櫌","櫾","汓","汼","沋","泈","浟","湵","滺","瀀","牗","牰","狖","猶",
    "甴","痏","祐","禉","秞","糿","纋","羐","羑","羗","耰","聈","肬","脜","脩","苃","莤","蒏","蓧","蕕",
    "蚘","蜏","褎","褏","幽","优","悠","忧","尤","由","邮","铀","犹","油","游","酉","有","友","右","佑",
    "釉","诱","又","幼","訧","誘","貁","卣","攸","侑","輏","輶","莠","莜","莸","迶","逌","尢","逰","遊",
    "邎","呦","郵","鄾","囿","酭","鈾","銪","銹","宥","柚","猷","牖","铕","疣","駀","蚰","蚴","蝣","蝤",
    "魷","鮋","鱿","鲉","黝","鼬","麀",":you"
    ,"丂","乻","亐","伃","俁","俼","偊","傴","僪","儥","兪","匬","唹","喅","喐","喩","噊","噳","圫","堉",
    "堣","堬","娛","娯","婾","媀","媮","嫗","嬩","寙","峿","崳","嵎","嶎","嶼","庽","彧","忬","悆","悇",
    "惐","慾","懙","戫","扵","挧","敔","斔","斞","旟","桙","棛","棜","棫","楀","楡","楰","櫲","欎","欝",
    "歈","歟","歶","汙","汚","淢","淯","湡","滪","漁","澞","澦","灪","灹","焴","燏","爩","牏","獄","獝",
    "玗","玙","琙","瑀","璵","畬","畭","瘉","癒","盓","睮","矞","砡","硢","礇","礖","礜","祤","禦","秗",
    "稢","稶","穀","穥","穻","箊","篽","籅","籞","籲","紆","緎","繘","罭","羭","翑","與","艅","芌","茰",
    "荢","萭","萮","蒮","蓹","蕍","蕷","薁","藇","蘌","蘛","虶","蜟","蝺","螸","蟈","衘","衧","袬","褕",
    "覦","迂","淤","于","盂","榆","虞","愚","舆","余","俞","逾","鱼","愉","渝","渔","隅","予","娱","雨",
    "与","屿","禹","宇","语","羽","玉","域","芋","郁","吁","遇","喻","峪","御","愈","欲","狱","育","誉",
    "浴","寓","裕","预","豫","驭","語","諛","諭","謣","譽","貐","貗","禺","毓","伛","俣","谀","谕","軉",
    "輍","輿","萸","蓣","轝","迃","揄","逳","遹","邘","鄅","圄","圉","酑","嵛","狳","釪","鈺","饫","馀",
    "庾","銉","阈","鋊","錥","鍝","鬻","妪","妤","纡","鐍","鐭","瑜","閼","閾","陓","隃","昱","觎","隩",
    "雓","腴","霱","欤","於","煜","燠","肀","聿","預","頨","顒","钰","颙","飫","餘","饇","鹆","鹬","瘐",
    "瘀","馭","窬","窳","騟","驈","蜮","蝓","骬","髃","竽","鬰","鬱","魊","魚","魣","臾","舁","鮽","鯲",
    "鰅","雩","龉","鱊","鱮","鳿","鴥","鴧","鴪","鵒","鷠","鷸","鸆","鸒","麌","齬",":yu"
    ,"傆","剈","厡","厵","員","喛","噮","囦","圎","園","圓","妴","媴","嫄","嫚","嬽","寃","弲","悁","杬",
    "棩","楥","榞","榬","櫞","淵","渁","渆","渕","湲","溒","灁","猨","獂","盶","禐","笎","緣","縁","羱",
    "肙","葾","蒝","蒬","薗","蜎","蜵","蝝","蝯","衏","裫","裷","褑","褤","鸳","渊","冤","元","垣","袁",
    "原","援","辕","园","员","圆","猿","源","缘","远","苑","愿","怨","院","謜","貟","贠","垸","塬","芫",
    "轅","掾","逺","遠","邍","邧","酛","鈨","沅","鋺","鎱","媛","瑗","橼","爰","眢","願","鸢","駌","騵",
    "螈","箢","鼋","鳶","鴛","鵷","鶢","鶰","鹓","黿","鼘","鼝",":yuan"
    ,"哾","噦","妜","嬳","岄","嶽","彟","彠","恱","悅","戉","抈","捳","曱","汋","爚","玥","矆","矱","礿",
    "禴","篗","籆","籰","粵","約","蘥","蚎","蚏","曰","约","越","跃","岳","粤","月","悦","阅","龠","趯",
    "跀","躍","躒","軏","哕","鈅","鉞","瀹","閱","閲","樾","刖","钺","髺","鸑","鸙","龥",":yue"
    ,"伝","傊","勻","呍","喗","囩","夽","奫","妘","惲","愪","慍","抎","抣","暈","枟","橒","殞","氳","沄",
    "涒","涢","溳","澐","煴","熅","熉","玧","畇","眃","磒","秐","筼","篔","紜","緷","縜","繧","腪","荺",
    "蒀","蒕","蒷","蕓","蘊","耘","云","郧","匀","陨","允","运","蕴","酝","晕","韵","孕","賱","贇","赟",
    "郓","芸","轀","運","鄆","鄖","醖","醞","狁","鈗","恽","愠","鋆","纭","韫","殒","昀","隕","雲","氲",
    "霣","熨","韗","韞","韻","頵","餫","馻","齫","齳",":yun"
    ,"噈","囋","帀","桚","沞","沯","紮","臜","臢","襍","匝","砸","杂","咋","拶","咂","鉔","雑","雜","雥",
    "韴",":za"
    ,"傤","儎","扗","洅","渽","溨","災","烖","睵","栽","哉","灾","宰","载","再","在","仔","賳","載","酨",
    "崽","甾",":zai"
    ,"偺","儧","儹","兂","喒","寁","揝","撍","暫","濽","灒","瓉","瓚","禶","穳","篸","簮","襸","咱","攒",
    "暂","赞","讃","讚","賛","贊","趲","蹔","鄼","酂","酇","鏨","鐕","瓒","昝","饡","簪","糌","趱","錾",":zan"
    ,"匨","塟","弉","牂","羘","臓","臟","蔵","赃","脏","葬","賍","賘","贓","贜","奘","銺","驵","臧","駔",
    "髒",":zang"
    ,"傮","唕","慥","栆","梍","棗","煰","璅","璪","皁","竃","竈","簉","艁","薻","遭","糟","凿","藻","枣",
    "早","澡","蚤","躁","噪","造","皂","灶","燥","譟","趮","蹧","唣","醩","鑿",":zao"
    ,"伬","則","啫","嘖","夨","嫧","崱","幘","庂","択","捑","擇","昗","樍","歵","汄","沢","泎","溭","澤",
    "皟","瞔","硳","礋","葃","蔶","蠌","责","择","则","泽","諎","謮","讁","責","仄","赜","賾","啧","帻",
    "迮","昃","笮","箦","舴","鸅","齚","齰",":ze"
    ,"蠈","贼","賊","鰂","鱡","鲗",":zei"
    ,"囎","怎","譛","谮",":zen"
    ,"増","曽","橧","熷","璔","矰","磳","縡","繒","增","憎","赠","譄","贈","鄫","鋥","缯","甑","罾","锃",
    "鬷","鱛",":zeng"
    ,"偧","劄","厏","囃","奓","宱","抯","拃","挓","挿","揷","搾","摣","柤","樝","溠","牐","皶","皻","箑",
    "箚","紥","耫","苲","藸","蚻","詐","扎","喳","渣","札","轧","铡","闸","眨","榨","乍","炸","诈","譇",
    "譗","柞","踷","蹅","軋","迊","揸","吒","咤","哳","醡","馇","鍘","閘","楂","霅","砟","餷","痄","蚱",
    "鮓","鮺","鲊","鲝","齄","齇",":zha"
    ,"債","夈","捚","斎","榸","檡","翟","簀","粂","摘","斋","宅","窄","债","寨","鉙","砦","瘵","骴","齋",":zhai"
    ,"佔","偡","嫸","岾","嶃","嶄","嶘","嶦","惉","戦","戰","斬","旜","栴","桟","棧","榐","欃","氈","氊",
    "琖","盞","綻","菚","薝","虥","虦","蛅","覱","詀","瞻","毡","詹","粘","沾","盏","斩","崭","展","蘸",
    "栈","占","战","站","湛","绽","譫","讝","趈","谵","蹍","輚","轏","搌","邅","醆","閚","霑","旃","颭",
    "飐","饘","驏","驙","魙","鳣","鸇","鹯",":zhan"
    ,"仧","傽","墇","帳","幥","張","慞","扙","暲","涱","漲","痮","瘬","瞕","长","礃","粀","粻","脹","蔁",
    "樟","章","彰","漳","张","掌","涨","杖","丈","帐","账","仗","胀","瘴","障","仉","賬","鄣","遧","幛",
    "嶂","獐","嫜","鏱","鐣","璋","長","镸","鞝","餦","騿","蟑","鱆","麞",":zhang"
    ,"佋","啅","垗","妱","巶","旐","曌","枛","櫂","炤","燳","爫","狣","瑵","皽","盄","瞾","罀","羄","肁",
    "肈","詔","招","昭","找","沼","赵","照","罩","兆","肇","召","謿","爪","趙","诏","釗","鉊","鍣","棹",
    "钊","駋","笊","鮡","鼂","鼌",":zhao"
    ,"乽","厇","啠","喆","嗻","嚞","埑","嫬","悊","摂","晢","晣","樜","歽","淛","砓","籷","粍","虴","蟄",
    "蟅","袩","襵","詟","遮","哲","蛰","辙","者","锗","蔗","这","浙","謫","謺","著","讋","着","谪","輒",
    "輙","轍","這","摺","鍺","柘","辄","磔","鹧","褶","蜇","赭","鮿","鷓",":zhe"
    ,"侲","偵","塦","姫","嫃","寊","屒","帪","幀","弫","抮","挋","揕","搸","敒","敶","昣","朾","栕","栚",
    "桭","楨","樼","殝","湞","潧","澵","獉","珎","瑧","眕","眞","眹","禎","禛","紖","絼","縝","縥","纼",
    "聄","萙","蒖","薽","蜄","袗","裖","覙","診","誫","珍","斟","真","甄","砧","臻","贞","针","侦","枕",
    "疹","诊","震","振","镇","阵","謓","帧","貞","賑","趂","圳","軫","轃","蓁","辴","迧","遉","酙","針",
    "鉁","鋴","浈","錱","鍖","鎭","鎮","缜","桢","椹","榛","轸","陣","赈","胗","朕","靕","祯","畛","稹",
    "鸩","駗","箴","鬒","鱵","鴆",":zhen"
    ,"佂","凧","埩","塣","姃","媜","崝","崢","嶒","徎","徰","愸","憕","抍","掙","撜","晸","氶","炡","烝",
    "爭","猙","癥","眐","睜","箏","篜","糽","聇","脀","証","諍","蒸","挣","睁","征","狰","争","怔","整",
    "拯","正","政","症","郑","证","證","诤","踭","鄭","峥","徵","鉦","錚","钲","铮","筝","鬇","鴊",":zheng"
    ,"亊","俧","倁","値","偫","傂","儨","凪","劕","劧","厔","坁","坧","垁","埶","執","墌","姪","娡","嬂",
    "崻","巵","帋","幟","庢","庤","廌","徏","徔","徝","徴","恉","慹","憄","懥","懫","戠","扻","抧","搘",
    "摯","擲","旘","晊","梔","梽","椥","榰","槜","櫍","櫛","歭","汦","沚","洔","洷","淽","滍","滯","漐",
    "潌","潪","瀄","熫","狾","猘","瓆","畤","疷","疻","瘈","砋","礩","祑","祬","禃","禔","禵","秇","秓",
    "秖","秪","秲","秷","稙","稺","筫","紙","紩","絺","綕","緻","縶","織","翐","聀","職","胑","胵","膱",
    "芖","茋","茝","藢","蘵","蟙","衼","袟","袠","製","襧","覟","觗","觝","觶","訨","誌","謢","芝","枝",
    "支","蜘","知","肢","脂","汁","之","织","职","直","植","殖","执","值","侄","址","指","止","趾","只",
    "旨","纸","志","挚","掷","至","致","置","帜","峙","制","智","秩","稚","质","炙","痔","滞","治","窒",
    "豑","豒","貭","卮","質","贄","陟","跱","蹠","郅","埴","躑","躓","軄","芷","軹","輊","迣","摭","遟",
    "帙","釞","鉄","忮","銍","銴","鋕","彘","咫","骘","鑕","铚","栉","枳","栀","桎","锧","轵","轾","阯",
    "贽","隲","隻","胝","膣","祉","祗","黹","雉","鸷","痣","馶","馽","駤","騭","騺","驇","蛭","絷","酯",
    "跖","踬","踯","豸","觯","鳷","鴙","鴲","鶨","鷙","鼅",":zhi"
    ,"伀","偅","刣","喠","堹","塚","妐","妕","媑","尰","幒","彸","徸","柊","歱","汷","炂","煄","狆","瘇",
    "眾","祌","種","筗","籦","終","緟","腫","茽","蔠","蚛","蝩","螤","衆","衳","衶","諥","中","盅","忠",
    "钟","衷","终","种","肿","重","仲","众","冢","蹱","迚","鈡","鍾","鐘","锺","螽","舯","踵","鴤","鼨",":zhong"
    ,"伷","侜","僽","冑","呪","咮","喌","噣","嚋","婤","徟","晝","晭","椆","炿","烐","珘","甃","疛","皺",
    "盩","睭","矪","箒","籒","籕","粙","紂","縐","菷","葤","薵","詋","詶","諏","謅","舟","周","州","洲",
    "诌","粥","轴","肘","帚","咒","皱","宙","昼","骤","譸","诪","賙","赒","軸","輈","輖","荮","辀","週",
    "啁","郮","銂","妯","纣","绉","霌","胄","碡","駎","駲","驟","籀","酎","鯞",":zhou"
    ,"佇","劅","劚","劯","囑","坾","墸","壴","孎","宔","尌","嵀","斀","斸","曯","朮","柷","樦","櫡","櫧",
    "櫫","欘","殶","濐","瀦","灟","炢","煑","燭","爥","眝","矚","砫","硃","祩","秼","竚","笜","筯","築",
    "篫","紵","紸","絑","纻","罜","羜","苧","茿","莇","蓫","蕏","薥","藷","蝫","蠋","蠩","蠾","袾","註",
    "詝","誅","諸","珠","株","蛛","朱","猪","诸","诛","逐","竹","烛","煮","拄","瞩","嘱","主","柱","助",
    "蛀","贮","铸","筑","住","注","祝","驻","豬","伫","貯","侏","跓","跦","邾","苎","茱","軴","鉒","銖",
    "鋳","洙","渚","潴","鑄","钃","杼","槠","橥","霔","炷","铢","飳","疰","瘃","馵","駐","駯","騶","竺",
    "箸","舳","翥","鮢","躅","鯺","鱁","麈","鴸","鸀","麆","鼄",":zhu"
    ,"檛","膼","抓","髽",":zhua"
    ,"睉","拽","跩",":zhuai"
    ,"僎","僝","囀","堟","専","專","灷","瑑","瑼","磗","磚","竱","簨","籑","耑","膞","蒃","蟤","諯","专",
    "砖","转","撰","篆","転","轉","啭","鄟","馔","顓","饌","颛",":zhuan"
    ,"壯","壵","妝","娤","庒","梉","樁","漴","焋","狀","幢","粧","糚","荘","莊","裝","桩","庄","装","妆",
    "撞","壮","状","丬",":zhuang"
    ,"倕","埀","墜","娷","沝","甀","畷","礈","笍","綴","縋","腏","膇","諈","椎","锥","追","赘","坠","缀",
    "贅","轛","醊","惴","錐","錣","骓","缒","鑆","餟","騅","隹","鵻",":zhui"
    ,"凖","宒","湻","準","稕","綧","衠","訰","諄","谆","准","迍","肫","窀",":zhun"
    ,"丵","圴","妰","娺","撯","擆","斮","斱","斲","斵","晫","梲","棳","椓","槕","濁","灂","炪","烵","犳",
    "琸","矠","硺","窡","窧","籗","籱","罬","蠗","蠿","諁","諑","謶","捉","拙","卓","桌","琢","茁","酌",
    "啄","灼","浊","倬","诼","擢","浞","涿","濯","鐯","鐲","禚","斫","镯","鵫","鷟",":zhuo"
    ,"倳","剚","呰","啙","嗞","姉","姕","孶","崰","杍","栥","椔","榟","橴","泚","湽","漬","澬","牸","眥",
    "矷","禌","秄","秶","紎","緇","胔","胾","芓","茊","茡","茲","菑","葘","薋","虸","訿","諮","吱","兹",
    "咨","资","姿","滋","淄","孜","紫","籽","滓","子","自","渍","字","貲","資","赼","趦","谘","茈","輜",
    "輺","鄑","嵫","釨","鈭","錙","鍿","鎡","姊","孳","缁","梓","镃","辎","赀","恣","眦","頾","頿","锱",
    "秭","耔","笫","粢","趑","鯔","觜","鰦","訾","龇","鲻","髭","鶅","鼒","齜",":zi"
    ,"唨",":zo"
    ,"倊","倧","傯","堫","嵏","嵕","嵸","惣","惾","愡","捴","揔","搃","摠","昮","朡","椶","潀","潈","潨",
    "熜","熧","燪","猔","猣","疭","瘲","碂","磫","稯","糉","綜","緃","総","緫","緵","縂","縦","縱","總",
    "翪","葼","蓗","蓯","蝬","鬃","棕","踪","宗","综","总","纵","豵","偬","踨","蹤","錝","鍯","鏓","鑁",
    "腙","騌","騣","骔","鬉","粽","鯮","鯼",":zong"
    ,"搊","棷","棸","緅","芻","菆","邹","走","奏","揍","赱","诹","陬","鄹","鄒","辶","驺","鯐","鯫","鲰",
    "黀","齺",":zou"
    ,"伜","倅","卆","哫","崒","崪","爼","稡","箤","紣","組","綷","詛","租","足","卒","族","祖","诅","阻",
    "组","俎","踤","踿","菹","錊","鎺","鏃","靻","顇","镞",":zu"
    ,"劗","欑","籫","繤","纉","纘","赚","钻","纂","賺","躦","攥","鉆","缵","鑚","鑽","躜",":zuan"
    ,"厜","嗺","噿","嶉","嶊","嶵","晬","枠","栬","槯","樶","檇","檌","濢","璻","睟","祽","穝","絊","纗",
    "蟕","嘴","醉","最","罪","辠","蕞","酔",":zui"
    ,"僔","噂","墫","嶟","拵","捘","繜","罇","譐","尊","遵","撙","銌","鐏","樽","鱒","鳟","鶎","鷷",":zun"
    ,"侳","咗","岝","岞","捽","椊","秨","稓","筰","糳","繓","葄","蓙","袏","昨","左","佐","做","作","坐",
    "座","阝","阼","唑","鈼","怍","胙","祚","飵","酢",":zuo"]
    ;

    //#endregion

}
